app/views/staffs/_form.html.erb

  <%= f.label :所属, {:class => "my-custom-class-l"}  %></br>
  <%= f.collection_select :affiliation_id, Affiliation.all, :id, :affiliation_name, {:include_blank => true} , {id:"affiliation_id", class: "my-custom-class" } %>
---
SELECT "affiliations".* FROM "affiliations"

  <%= f.label :complete_flag, "外注の場合は、外注業者を登録して下さい", {} %>
  <%= f.collection_select :supplier_master_id, SupplierMaster.all, :id, :supplier_name ,
     {:include_blank => true} ,
       {id: "supplier_master_id", :tabindex=>"7", style: 'width:350px;', :class => "searchableSupplier"} %>
---
SELECT "supplier_masters".* FROM "supplier_masters"