app/views/staffs/index.html.erb

SELECT "affiliations".* FROM "affiliations"
---
        <td><%= staff.furigana %></td>
        <% if staff.affiliation_id.present? %>