app/views/delivery_slip_headers/index.html.erb

  <%= f.label :delivery_slip_code, '納品Ｎｏ：' %>
  <%= f.select :id_eq, DeliverySlipHeader.all.map{|st| [st.quotation_code, st.id]}, {include_blank: true}, {style: 'width:220px' , class: "searchableDeliverySlipCode" } %>
---
SELECT "delivery_slip_headers".* FROM "delivery_slip_headers"

  <%= f.label :customer_name, '得意先：' %>
  <%= f.select :customer_id_eq, DeliverySlipHeader.all.select(:customer_name, :customer_id).uniq.map{|st| [st.customer_name, st.customer_id]}, {include_blank: true}, {style: 'width:440px' , class: "searchableCustomerName" } %>
---
SELECT "delivery_slip_headers"."customer_name", "delivery_slip_headers"."customer_id" FROM "delivery_slip_headers"