app/views/storage_inventory_histories/index.html.erb

SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2
SELECT "unit_masters".* FROM "unit_masters" WHERE "unit_masters"."id" = $1 ORDER BY "unit_masters"."id" ASC LIMIT $2
---
        <% if storage_inventory_history.material_master.unit_id.present? %>
          <% @unit_master = UnitMaster.where(id: storage_inventory_history.material_master.unit_id).first %>