app/views/quotation_headers/index.html.erb

  <%= f.label :construction_code, '見積Ｎｏ：' %>
  <!--<%= f.select :id_eq, options_from_collection_for_select(QuotationHeader.all, "id", "quotation_code") , {include_blank: true}, {style: 'width:220px' , class: "searchableQuotationCode" } %></br>-->
---
SELECT "quotation_headers".* FROM "quotation_headers"

  <%= f.label :customer_name, '得意先：' %>
  <%= f.select :customer_id_eq, QuotationHeader.all.select(:customer_name, :customer_id).uniq.map{|st| [st.customer_name, st.customer_id]}, {include_blank: true}, {style: 'width:440px' , class: "searchableCustomerName" } %>
---
SELECT "quotation_headers"."customer_name", "quotation_headers"."customer_id" FROM "quotation_headers"