app/views/inventories/_form.html.erb

SELECT "material_masters".* FROM "material_masters"
---
  <%= f.label :品名, {:class => "my-custom-class-l"}  %></br>
  <%= f.collection_select :material_master_id, MaterialMaster.all,  :id, :p_material_code_name,
      {:prompt => "どれか一つを選択して下さい",:selected => @inventory.material_master_id} ,
      {id:'material_master_id', :class => "searchableSelect2_1" }  %>

SELECT "unit_masters".* FROM "unit_masters"
---
  <%= f.label :単位, {:class => "my-custom-class-l"}  %></br>
  <%= f.collection_select :unit_master_id, UnitMaster.all,:id, :unit_name, {:selected => @inventory.unit_master_id || 1} ,
     {id:"unit_id", style: 'width:110px;' , :class => "searchableSelect2_2"} %>

SELECT "supplier_masters".* FROM "supplier_masters"
---
  <%= f.label :仕入業者, {:class => "my-custom-class-l"}  %></br>
  <%= f.collection_select :supplier_master_id, SupplierMaster.all,  :id, :supplier_name,
      {:prompt => "どれか一つを選択して下さい"} ,
      {id:'supplier_master_id', :class => "searchableSelect2_3" }  %>