app/views/inventories/index.html.erb

SELECT "inventories".* FROM "inventories"
---

  <%= f.select :material_master_id_eq, Inventory.all.map{|st| [st.material_master.material_code, st.material_master.id]}, {include_blank: true},
	      {style: 'width:220px' , class: "searchableMaterialCode" } %>

SELECT "inventory_categories".* FROM "inventory_categories"
---
    <%= f.label :inventory_category, 'カテゴリー：' %>
    <%= f.select :with_material_category_include, InventoryCategory.all.map{|st| [st.name, st.id]}, {include_blank: true},
	      {style: 'width:220px' , class: "searchableMaterialCode" } %></br>