app/views/quotation_detail_middle_classifications/_modal.html.erb

  <!--WorkingCategory to @working_category-->
  <!--WorkingCategory.order('seq').all to -->
---
SELECT "working_categories".* FROM "working_categories" ORDER BY seq


  <%= f.select :working_middle_item_subcategory_id, WorkingSubcategory.all.map{|t| [t.name, t.id]}, {:include_blank => true},
    {id:'working_middle_item_subcategory_id', :class => "my-custom-class", style: 'width:190px;font-size:14px;', :tabindex=>"6" } %>
---
SELECT "working_subcategories".* FROM "working_subcategories"

  <%= f.label :"品名(固有)" , {:class => "my-custom-class-l"} %></br>
  <%= f.collection_select :working_specific_middle_item_id, WorkingSpecificMiddleItem.where(:quotation_header_id => params[:quotation_header_id]).order('seq'), :id, :working_middle_item_name,
    {:include_blank => true} ,
    {id:'working_specific_middle_item_id', :class => "searchableSelect2_5",  style: 'width:210px' } %>
---
SELECT "working_specific_middle_items".* FROM "working_specific_middle_items" WHERE "working_specific_middle_items"."quotation_header_id" = $1 ORDER BY seq

  <%= f.label :"単位" , {:class => "my-custom-class-l"} %></br>
  <%= f.collection_select :working_unit_id, WorkingUnit.all, :id, :working_unit_name, {:prompt => 'どれか一つを選択して下さい',
      :selected => @quotation_detail_middle_classification.working_unit_id || 1 } ,
      {id:'working_unit_id', :class => "searchableSelect2_4",  style: 'width:120px' } %></br>
---
SELECT "working_units".* FROM "working_units"


  <%= f.collection_select :working_subcategory_select_hide, WorkingSubcategory.order('seq').all, :id, :name,  {} ,
         {id:"working_subcategory_select_hide",  hidden: true  } %>
---
SELECT "working_subcategories".* FROM "working_subcategories" ORDER BY seq