app/views/storage_inventories/index.html.erb

    <%= f.label :material_code, '品番：：' %>
    <%= f.select :material_master_id_eq, StorageInventory.all.map{|st| [st.material_master.material_code, st.material_master.id]}, {include_blank: true},
       {style: 'width:220px' , class: "searchableMaterialCode" } %>
    <%= f.label :category, 'カテゴリー：' %>
    <%= f.select :with_material_category_include, InventoryCategory.all.map{|st| [st.name, st.id]}, {include_blank: true},
	      {style: 'width:220px' , class: "searchableMaterialCode" } %>
---
SELECT "storage_inventories".* FROM "storage_inventories"
SELECT "inventory_categories".* FROM "inventory_categories"

  <tbody>
    <% @storage_inventories.joins(:material_master).select("storage_inventories.*, material_masters.material_code").order("material_code").each do |storage_inventory| %>
---
SELECT storage_inventories.*, material_masters.material_code FROM "storage_inventories" INNER JOIN "material_masters" ON "material_masters"."id" = "storage_inventories"."material_master_id" ORDER BY material_code LIMIT $1 OFFSET $2

        <% if storage_inventory.material_master.present? %>
          <% @unit_master = UnitMaster.where(id: storage_inventory.material_master.unit_id).first %>
---
SELECT "unit_masters".* FROM "unit_masters" WHERE "unit_masters"."id" IS NULL ORDER BY "unit_masters"."id" ASC LIMIT $1