app/views/storage_inventories/show.html.erb

  <% if @storage_inventory.material_master.unit_id.present? %>
    <% @unit_master = UnitMaster.find(@storage_inventory.material_master.unit_id)%>
---
SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2