app/views/working_middle_items/_index.html.erb

        <td><%= working_middle_item.working_middle_specification %></td>
        <% if working_middle_item.WorkingUnit.present? %>
---
SELECT "working_units".* FROM "working_units" WHERE "working_units"."id" = $1 LIMIT $2