app/views/working_middle_items/_modal.html.erb

SELECT "working_subcategories".* FROM "working_subcategories" ORDER BY seq
---
        <%= f.input :unit_master_id_hide, input_html:{id:'unit_master_id_hide'}, as: :hidden  %>
        <%= f.collection_select :working_subcategory_select_hide, WorkingSubcategory.order('seq').all, :id, :name,  {} ,
            {id:"working_subcategory_select_hide",  hidden: true  } %>

SELECT "working_middle_items".* FROM "working_middle_items" ORDER BY seq
---
       <%= f.input :master_insert_flag , input_html:{ id:"master_insert_flag", :value => "true" }, as: :hidden %>
       <%= f.collection_select :working_middle_item_id_select_hide, WorkingMiddleItem.order('seq').all, :id, :working_middle_item_name,  {} ,
         {id:"working_middle_item_id_select_hide",  hidden: true  } %>
       <%= f.collection_select :working_middle_item_short_name_select_hide, WorkingMiddleItem.order('seq').all, :id, :working_middle_item_short_name,  {} ,
         {id:"working_middle_item_short_name_select_hide",  hidden: true   } %>