app/views/working_middle_items/_modal.html.erb

		<%= f.label :"カテゴリー　" , {:class => "my-custom-class-l", style: 'margin-right :0px;width:80px;font-size:10' } %>
        <%= f.select :working_middle_item_category_id, WorkingCategory.order('seq').all.map{|t| [t.category_name, t.id]}, {:selected => @working_middle_item.working_middle_item_category_id || 1},
           {id:'working_middle_item_category_id', :class => "my-custom-class", :onchange => "setSubacategoryExtractByParent()", style: 'width:180px;height:25px;margin-top:-22px;margin-left : 40px;font-size:14;', :tabindex=> "4" } %>
---
SELECT "working_categories".* FROM "working_categories" ORDER BY seq


        <%= f.select :working_subcategory_id, WorkingSubcategory.order('seq').where(:working_category_id => @working_middle_item.working_middle_item_category_id).map{|t| [t.name, t.id]}, {:include_blank => true },
           {id:'working_subcategory_id', :class => "my-custom-class", style: 'width:180px;height:25px;margin-top:-22px;margin-left : 75px;font-size:14;', :tabindex=> "5" } %>
---
SELECT "working_subcategories".* FROM "working_subcategories" WHERE "working_subcategories"."working_category_id" = $1 ORDER BY seq

		<div class="col-md-5" , style="margin-left : -15px;margin-top : 0px">
		<%= f.collection_select :working_unit_id, WorkingUnit.all, :id, :working_unit_name,
          {:prompt => 'どれか一つを選択して下さい', :selected => @working_middle_item.working_unit_id || 2 } ,
            {id:'working_unit_id', :class => "searchableSelect2_1", style: 'width:180px' } %>
---
SELECT "working_units".* FROM "working_units"

        <%= f.input :unit_master_id_hide, input_html:{id:'unit_master_id_hide'}, as: :hidden  %>
        <%= f.collection_select :working_subcategory_select_hide, WorkingSubcategory.order('seq').all, :id, :name,  {} ,
            {id:"working_subcategory_select_hide",  hidden: true  } %>
---
SELECT "working_subcategories".* FROM "working_subcategories" ORDER BY seq

       <%= f.input :master_insert_flag , input_html:{ id:"master_insert_flag", :value => "true" }, as: :hidden %>
       <%= f.collection_select :working_middle_item_id_select_hide, WorkingMiddleItem.order('seq').all, :id, :working_middle_item_name,  {} ,
         {id:"working_middle_item_id_select_hide",  hidden: true  } %>
---
SELECT "working_middle_items".* FROM "working_middle_items" ORDER BY seq