app/views/working_middle_items/_working_small_item_fields.html.erb

  <!--品番-->
  <!--<%= f.collection_select :working_small_item_id, MaterialMaster.all, :id, :p_material_code_name, {:selected => f.object.working_small_item_id || 1, } ,
    {class: "searchableMaterial" , id: "working_small_item_id" << f.options[:child_index].to_s ,  style: 'width:690px' } %>-->
---
SELECT "material_masters".* FROM "material_masters"

  <% if f.object.maker_master_id.present? %>
    <% @material_master = MaterialMaster.find(f.object.working_small_item_id) %>
---
SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2