app/views/working_middle_items/_working_small_item_fields.html.erb

SELECT "maker_masters".* FROM "maker_masters"
SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 ORDER BY "material_masters"."id" ASC LIMIT $2
---
  <!--moved251027-->
  <% if f.object.maker_master_id.present? %>
    <% if f.object.working_small_item_id.present? %>
      <% @material_master = MaterialMaster.where(:id => f.object.working_small_item_id).first %>

SELECT "material_masters".* FROM "material_masters"
---
  <!--品番-->
  <!--<%= f.collection_select :working_small_item_id, MaterialMaster.all, :id, :p_material_code_name, {:selected => f.object.working_small_item_id || 1, } ,
    {class: "searchableMaterial" , id: "working_small_item_id" << f.options[:child_index].to_s ,  style: 'width:690px' } %>-->

SELECT "maker_masters".* FROM "maker_masters"
SELECT "unit_masters".* FROM "unit_masters"
---
  <!--test-->
  <!--<%= f.collection_select :maker_master_id, MakerMaster.all, :id, :maker_name, {:selected => f.object.maker_master_id || 1} ,
      {class: "searchableMaker" , id: "maker_master_id" , style: 'width:180px;'} %>-->

SELECT "unit_masters".* FROM "unit_masters"
---
  <!--upd251027 chg width 180px to-->
  <%= f.collection_select :maker_master_id, MakerMaster.all, :id, :maker_name, {:selected => f.object.maker_master_id || 1} ,
      {class: "searchableMaker" , id: "maker_master_id" << f.options[:child_index].to_s , style: 'width:130px;'} %>

SELECT "unit_masters".* FROM "unit_masters"
---
  <%= f.label :unit_master_id, "単位:　"%>
  <!--<%= f.collection_select :unit_master_id, UnitMaster.all, :id, :unit_name, {:selected => f.object.unit_master_id || 1} ,
      {class: "searchableUnit" , id: "unit_master_id" , style: 'width:60px;'} %>-->

SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2
---
    <% if f.object.working_small_item_id.present? %>
      <% @material_master = MaterialMaster.find(f.object.working_small_item_id) %>