app/views/working_middle_items/index.html.erb

SELECT "working_middle_items".* FROM "working_middle_items"
---
    <%= f.label :working_middle_item_name, '品名：' %>
    <%= f.select :id_eq, WorkingMiddleItem.all.map{|st| [st.working_middle_item_name, st.id]},
         {include_blank: true}, {id:"working_middle_item_id_select_hide",style: 'width:220px' , class: "searchableLargeItem" } %>

SELECT "working_categories".* FROM "working_categories" ORDER BY seq
---
    <%= f.label :working_middle_item_name, 'カテゴリー：' %>
	<%= f.select :working_category_id_eq, WorkingCategory.order('seq').all.map{|st| [st.category_name, st.id]}, {include_blank: true}, {id:'working_middle_item_category_for_call', style: 'width:220px' , class: "searchableCategory",
      :onchange => "setItemExtractByCategory()" } %>

SELECT "working_subcategories".* FROM "working_subcategories" WHERE "working_subcategories"."working_category_id" IS NULL ORDER BY seq
---
    <%= f.label :working_subcategory_id, 'サブカテゴリー：' %>
	<%= f.select :working_subcategory_id_eq, WorkingSubcategory.where(:working_category_id => f.object.working_category_id_eq).order('seq').map{|st| [st.name, st.id]}, {include_blank: true}, {id:'working_subcategory_select_hide',
               style: 'width:220px' , class: "searchableSubcategory"} %>