app/views/material_masters/_form.html.erb

SELECT "maker_masters".* FROM "maker_masters"
---
  <%= f.label :メーカー, {:class => "my-custom-class-l", :id => 'MakerMaster'} %></br>
  <%= f.collection_select :maker_id,  MakerMaster.all, :id, :maker_name, {:prompt => "どれか一つを選択して下さい",:validate => true} ,
      {:id => 'maker_id', class: "searchableSelect2_1",  style: 'width:220px'} %></br>

SELECT "unit_masters".* FROM "unit_masters"
---
  <%= f.label :標準単位, {:class => "my-custom-class-l"} %></br>
  <%= f.collection_select :unit_id,  UnitMaster.all, :id, :unit_name, {:prompt => "どれか一つを選択して下さい",:validate => true} ,
       { :id => 'unit_id', class: "searchableSelect2_2",  style: 'width:220px' } %>

SELECT "material_categories".* FROM "material_categories"
---
  <%= f.label :カテゴリー, {:class => "my-custom-class-l"} %></br>
  <%= f.collection_select :material_category_id,  MaterialCategory.all, :id, :name, {:include_blank => true} ,
      {:id => 'material_category_id', class: "searchableSelect2_3",  style: 'width:220px'} %>

SELECT "inventory_categories".* FROM "inventory_categories"
---
  <%= f.label_tag :inventory_category_id, '在庫品目(*在庫管理する場合のみ登録して下さい。)' , { style: 'margin-left:-15px' }%></br>
  <%= f.collection_select :inventory_category_id, InventoryCategory.all, :id, :name, {:include_blank => true},
      {id:'inventory_category_id', :class => "searchableSelect2_4",
       style: 'width:220px;margin-left:-15px;font-size:16px;background-color:#ffffff;' } %>