app/views/material_masters/index.html.erb

SELECT "material_masters".* FROM "material_masters"
---
   <%= f.label :material_code, '品番：：' %>
   <!--<%= f.select :id_in, MaterialMaster.all.map{|st| [st.material_code, st.id]},
           {include_blank: true},  {style: 'width:900px' , class: "searchableMaterialCode" , multiple: true}  %>-->

SELECT "purchase_unit_prices".* FROM "purchase_unit_prices"
---
   <!--本来なら複数でやりたいが上手くいかないので、保留-->
   <!--<%= f.select :with_supplier_material_code, options_from_collection_for_select(PurchaseUnitPrice.all, "id", :supplier_material_code, params[:q].try(:[], :with_supplier_material_code)) ,
       {include_blank: true}, {style: 'width:900px' , class: "searchableSupplierMaterialCode", multiple: true }  %>-->

SELECT "maker_masters".* FROM "maker_masters"
---
   <%= f.label :maker_code, 'メーカー：：' %>
   <%= f.select :maker_id_eq, MakerMaster.all.map{|st| [st.maker_name, st.id]}, {include_blank: true},
         {style: 'width:220px' , class: "searchableMaker" } %>

SELECT "material_categories".* FROM "material_categories"
---
   <%= f.label :material_category_id, '分類：：' %>
   <%= f.select :material_category_id_eq, MaterialCategory.all.map{|st| [st.name, st.id]}, {include_blank: true},
         {style: 'width:220px' , class: "searchableCategory" } %>

SELECT "maker_masters".* FROM "maker_masters" WHERE "maker_masters"."id" = $1 LIMIT $2
---
        <td><%= material_master.material_name %></td>
        <% if material_master.MakerMaster.present? %>