app/pdfs/bid_comparison_list_pdf.rb

SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2
---

      #仕入先１
      if quotation_material_header.supplier_id_1.present?
        supplier = SupplierMaster.find(quotation_material_header.supplier_id_1)

SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2
---

      #仕入先２
      if quotation_material_header.supplier_id_2.present?
        supplier = SupplierMaster.find(quotation_material_header.supplier_id_2)

SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2
---

      #仕入先３
      if quotation_material_header.supplier_id_3.present?
        supplier = SupplierMaster.find(quotation_material_header.supplier_id_3)

SELECT "quotation_material_details".* FROM "quotation_material_details" WHERE "quotation_material_details"."quotation_material_header_id" = $1
---

    quotation_material_details = QuotationMaterialDetail.where(quotation_material_header_id: quotation_material_header.id)

    if quotation_material_details.present?