app/pdfs/construction_cost_summary_pdf.rb


		   report.page.item(:construction_code).value(construction_code)
		   report.page.item(:construction_name).value(construction_costs.construction_datum.construction_name)
		   report.page.item(:customer_name).value(construction_costs.construction_datum.CustomerMaster.customer_name)
---
SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2