app/pdfs/delivery_slip_pdf.rb

      #---見出し---
      if @flag.nil?
        @flag = "1"
        @delivery_slip_headers = DeliverySlipHeader.find(delivery_slip_detail_large_classification.delivery_slip_header_id)
---
SELECT "delivery_slip_headers".* FROM "delivery_slip_headers" WHERE "delivery_slip_headers"."id" = $1 LIMIT $2

        if @quantity.present?
          @quantity = "%.4g" %  @quantity
        end
        if delivery_slip_detail_large_classification.WorkingUnit.present?
---
SELECT "working_units".* FROM "working_units" WHERE "working_units"."id" = $1 LIMIT $2

  def self.set_detail_data
    #納品書(表紙)のページ番号をマイナスさせるためのカウンター。
    @estimation_sheet_pages = @report.page_count

    #内訳データでループ
    @delivery_slip_detail_large_classifications.order(:line_number).each do |delivery_slip_detail_large_classification|

      delivery_slip_header_id = delivery_slip_detail_large_classification.delivery_slip_header_id
      delivery_slip_detail_large_classification_id =  delivery_slip_detail_large_classification.id

      @delivery_slip_detail_middle_classifications = DeliverySlipDetailMiddleClassification.where(:delivery_slip_header_id => delivery_slip_header_id).
                                                 where(:delivery_slip_detail_large_classification_id => delivery_slip_detail_large_classification_id).where("id is NOT NULL")
---
SELECT "delivery_slip_detail_middle_classifications".* FROM "delivery_slip_detail_middle_classifications" WHERE "delivery_slip_detail_middle_classifications"."delivery_slip_header_id" = $1 AND "delivery_slip_detail_middle_classifications"."delivery_slip_detail_large_classification_id" = $2 AND (id is NOT NULL)

        end

        #品目名
        @report.page.item(:working_large_item_name).value(delivery_slip_detail_middle_classification.DeliverySlipDetailLargeClassification.working_large_item_name)

        #仕様名
        @report.page.item(:working_large_specification).value(delivery_slip_detail_middle_classification.DeliverySlipDetailLargeClassification.working_large_specification)
---
SELECT "delivery_slip_detail_large_classifications".* FROM "delivery_slip_detail_large_classifications" WHERE "delivery_slip_detail_large_classifications"."id" = $1 LIMIT $2