app/pdfs/estimation_sheet_pdf.rb


    #事前に明細データの有無を確認
    quotation_detail_large_classifications.order(:line_number).each do |quotation_detail_large_classification|
      @quotation_headers = QuotationHeader.find(quotation_detail_large_classification.quotation_header_id)
---
SELECT "quotation_headers".* FROM "quotation_headers" WHERE "quotation_headers"."id" = $1 LIMIT $2

        if @quantity.present?
          @quantity = "%.4g" %  @quantity
        end
        if quotation_detail_large_classification.WorkingUnit.present?
---
SELECT "working_units".* FROM "working_units" WHERE "working_units"."id" = $1 LIMIT $2

  def self.set_detail_data

    #見積書(表紙)のページ番号をマイナスさせるためのカウンター。
    @estimation_sheet_pages = @report.page_count

    #upd170626
    @quotation_detail_large_classifications.order(:line_number).each do |quotation_detail_large_classification|
      if @history == false
        quotation_header_id = quotation_detail_large_classification.quotation_header_id
      else
        quotation_header_id = quotation_detail_large_classification.quotation_header_history_id
      end
      quotation_detail_large_classification_id =  quotation_detail_large_classification.id

      if @history == false
      @quotation_detail_middle_classifications = QuotationDetailMiddleClassification.where(:quotation_header_id => quotation_header_id).
                                                 where(:quotation_detail_large_classification_id => quotation_detail_large_classification_id).where("id is NOT NULL")
---
SELECT "quotation_detail_middle_classifications".* FROM "quotation_detail_middle_classifications" WHERE "quotation_detail_middle_classifications"."quotation_header_id" = $1 AND "quotation_detail_middle_classifications"."quotation_detail_large_classification_id" = $2 AND (id is NOT NULL)


        if @history == false
          #品目名
          @report.page.item(:working_large_item_name).value(quotation_detail_middle_classification.QuotationDetailLargeClassification.working_large_item_name)
---
SELECT "quotation_detail_large_classifications".* FROM "quotation_detail_large_classifications" WHERE "quotation_detail_large_classifications"."id" = $1 LIMIT $2