app/pdfs/invoice_pdf.rb

SELECT "companies".* FROM "companies" ORDER BY "companies"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def self.set_company_info
    company = Company.first