app/pdfs/invoice_landscape_pdf.rb

SELECT "companies".* FROM "companies" ORDER BY "companies"."id" ASC LIMIT $1
---
  def self.create(invoice_detail_large_classifications, company_id)
	#請求書(横)PDF発行
    #新元号対応 190401
    require "date"
    d_heisei_limit = Date.parse("2019/5/1")


    for num in 1..2 do  #add251128 ２部印刷する

      if num == 1
        # tlfファイルを読み込む
        #変数reportはインスタンス変数に変更
        @report = Thinreports::Report.new(layout: "#{Rails.root}/app/pdfs/invoice_landscape_pdf.tlf")
      end
      @labor_amount_large = 0
      @labor_amount_total_large = 0

      # 1ページ目を開始
      @report.start_new_page

      @flag = nil

      #インボイス番号を出す
      company = Company.first

SELECT "invoice_headers".* FROM "invoice_headers" WHERE "invoice_headers"."id" = $1 ORDER BY "invoice_headers"."id" ASC LIMIT $2
---
          @flag = "1"
          #@invoice_headers = InvoiceHeader.find(invoice_detail_large_classification.invoice_header_id)
          #upd230720
          @invoice_headers = InvoiceHeader.where(id: invoice_detail_large_classification.invoice_header_id).first

SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 ORDER BY "customer_masters"."id" ASC LIMIT $2
SELECT "construction_costs".* FROM "construction_costs" WHERE "construction_costs"."construction_datum_id" = $1 LIMIT $2
---

            #@customer_masters = CustomerMaster.find(@invoice_headers.customer_id)
            #upd230720
            @customer_masters = CustomerMaster.where(id: @invoice_headers.customer_id).first
            @construction_costs = ConstructionCost.find_by(construction_datum_id: @invoice_headers.construction_datum_id)

SELECT "working_units".* FROM "working_units" WHERE "working_units"."id" = $1 LIMIT $2
---
            #桁区切り(delimiterは使えないので)
            @execution_quantity = @execution_quantity.to_s.gsub(/(\d)(?=\d{3}+$)/, '\\1,')
          end
          if invoice_detail_large_classification.WorkingUnit.present?

SELECT "invoice_detail_middle_classifications".* FROM "invoice_detail_middle_classifications" WHERE "invoice_detail_middle_classifications"."invoice_header_id" = $1 AND "invoice_detail_middle_classifications"."invoice_detail_large_classification_id" = $2 AND (id is NOT NULL)
---
  def self.set_detail_data

    #見積書(表紙)のページ番号をマイナスさせるためのカウンター。
    @estimation_sheet_pages = @report.page_count

    #内訳データでループ
    #$invoice_detail_large_classifications.order(:line_number).each do |invoice_detail_large_classification|
    #upd170626
    @invoice_detail_large_classifications.order(:line_number).each do |invoice_detail_large_classification|

      invoice_header_id = invoice_detail_large_classification.invoice_header_id
      invoice_detail_large_classification_id =  invoice_detail_large_classification.id

      #$invoice_detail_middle_classifications = InvoiceDetailMiddleClassification.where(:invoice_header_id => invoice_header_id).
      #                                          where(:invoice_detail_large_classification_id => invoice_detail_large_classification_id).where("id is NOT NULL")
      @invoice_detail_middle_classifications = InvoiceDetailMiddleClassification.where(:invoice_header_id => invoice_header_id).
                                                 where(:invoice_detail_large_classification_id => invoice_detail_large_classification_id).where("id is NOT NULL")

SELECT "invoice_detail_large_classifications".* FROM "invoice_detail_large_classifications" WHERE "invoice_detail_large_classifications"."id" = $1 LIMIT $2
---
        end

        #品目名
        @report.page.item(:working_large_item_name).value(invoice_detail_middle_classification.InvoiceDetailLargeClassification.working_large_item_name)

        #仕様名
        @report.page.item(:working_large_specification).value(invoice_detail_middle_classification.InvoiceDetailLargeClassification.working_large_specification)

SELECT "working_units".* FROM "working_units" WHERE "working_units"."id" = $1 LIMIT $2
---
          #桁区切り(delimiterは使えないので)
          @execution_quantity = @execution_quantity.to_s.gsub(/(\d)(?=\d{3}+$)/, '\\1,')
        end
        if invoice_detail_middle_classification.WorkingUnit.present?