app/pdfs/invoice_landscape_pdf.rb

        if @execution_quantity.present?
          @execution_quantity = "%.2g" %  @execution_quantity
        end
        if invoice_detail_large_classification.WorkingUnit.present?
---
SELECT "working_units".* FROM "working_units" WHERE "working_units"."id" = $1 LIMIT $2

          item_name = invoice_detail_large_classification.working_large_item_name
          #納品書データから工事IDを引っ張る
          if invoice_detail_large_classification.delivery_slip_header_id.present?
            delivery_slip_header = DeliverySlipHeader.where(:id => invoice_detail_large_classification.delivery_slip_header_id).first
---
SELECT "delivery_slip_headers".* FROM "delivery_slip_headers" WHERE "delivery_slip_headers"."id" = $1 ORDER BY "delivery_slip_headers"."id" ASC LIMIT $2

  def self.set_detail_data

    #見積書(表紙)のページ番号をマイナスさせるためのカウンター。
    @estimation_sheet_pages = @report.page_count

    #内訳データでループ
    #$invoice_detail_large_classifications.order(:line_number).each do |invoice_detail_large_classification|
    #upd170626
    @invoice_detail_large_classifications.order(:line_number).each do |invoice_detail_large_classification|

      invoice_header_id = invoice_detail_large_classification.invoice_header_id
      invoice_detail_large_classification_id =  invoice_detail_large_classification.id

      #$invoice_detail_middle_classifications = InvoiceDetailMiddleClassification.where(:invoice_header_id => invoice_header_id).
      #                                          where(:invoice_detail_large_classification_id => invoice_detail_large_classification_id).where("id is NOT NULL")
      @invoice_detail_middle_classifications = InvoiceDetailMiddleClassification.where(:invoice_header_id => invoice_header_id).
                                                 where(:invoice_detail_large_classification_id => invoice_detail_large_classification_id).where("id is NOT NULL")
---
SELECT "invoice_detail_middle_classifications".* FROM "invoice_detail_middle_classifications" WHERE "invoice_detail_middle_classifications"."invoice_header_id" = $1 AND "invoice_detail_middle_classifications"."invoice_detail_large_classification_id" = $2 AND (id is NOT NULL)

        end

        #品目名
        @report.page.item(:working_large_item_name).value(invoice_detail_middle_classification.InvoiceDetailLargeClassification.working_large_item_name)
---
SELECT "invoice_detail_large_classifications".* FROM "invoice_detail_large_classifications" WHERE "invoice_detail_large_classifications"."id" = $1 LIMIT $2