app/pdfs/outsourcing_invoice_pdf.rb

SELECT "companies".* FROM "companies" ORDER BY "companies"."id" ASC LIMIT $1  [["LIMIT", 1]]
---

      #---見出し---
      #会社情報の取得・表示
      company = Company.first

SELECT "outsourcing_costs".* FROM "outsourcing_costs" WHERE "outsourcing_costs"."purchase_order_datum_id" = $1 AND "outsourcing_costs"."supplier_master_id" = $2 ORDER BY "outsourcing_costs"."id" ASC LIMIT $3  [["purchase_order_datum_id", 2392], ["supplier_master_id", 37], ["LIMIT", 1]]
---
      #注番で優先
        #outsourcing_cost = OutsourcingCost.where(:purchase_order_datum_id => purchase_data_current.purchase_order_datum_id).
        #                   where(:staff_id => staff_id).first
        outsourcing_cost = OutsourcingCost.where(:purchase_order_datum_id => purchase_data_current.purchase_order_datum_id).
                           where(:supplier_master_id => supplier_master_id).first

SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2  [["id", 86], ["LIMIT", 1]]
---
      report.page.item(:construction_name).value(construction_name)

      #得意先名
      if purchase_data_current.construction_datum.present? && purchase_data_current.construction_datum.CustomerMaster.present?
        report.page.item(:customer_name).value(purchase_data_current.construction_datum.CustomerMaster.customer_name)

SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 ORDER BY "supplier_masters"."id" ASC LIMIT $2  [["id", 37], ["LIMIT", 1]]
---
  def set_supplier_info(supplier_master_id)
    #初期化
    @supplier_post = ""
    @supplier_address = ""
    @supplier_name = ""
    @supplier_position = ""
    @supplier_responsible = ""
    @supplier_tel = ""
    @supplier_fax_label = ""
    @supplier_fax = ""
    #
    @supplier_bank_name = ""
    @supplier_bank_branch_name = ""
    @supplier_account_type_name = ""
    @supplier_account_number = ""
    @supplier_account_name = ""
    #

    supplier = SupplierMaster.where(:id => supplier_master_id).first

    if supplier.present?
      @supplier_post = supplier.post
      @supplier_address = supplier.address
      @supplier_name = supplier.supplier_name
      @supplier_position = "代表"  #ひとまず固定で
      @supplier_responsible = supplier.responsible_name
      @supplier_tel = supplier.tel_main

      @supplier_bank_name = supplier.bank_name
      @supplier_bank_branch_name = supplier.bank_branch_name
      if supplier.account_type.present?