app/pdfs/outsourcing_invoice_pdf.rb

SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2
---
      report.page.item(:construction_name).value(construction_name)

      #得意先名
      if purchase_data_current.construction_datum.present? && purchase_data_current.construction_datum.CustomerMaster.present?

SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 ORDER BY "supplier_masters"."id" ASC LIMIT $2
---
  def set_supplier_info(supplier_master_id)
    #初期化
    @supplier_post = ""
    @supplier_address = ""
    @supplier_name = ""
    @supplier_position = ""
    @supplier_responsible = ""
    @supplier_tel = ""
    @supplier_fax_label = ""
    @supplier_fax = ""
    #
    @supplier_bank_name = ""
    @supplier_bank_branch_name = ""
    @supplier_account_type_name = ""
    @supplier_account_number = ""
    @supplier_account_name = ""
    #

    supplier = SupplierMaster.where(:id => supplier_master_id).first