app/pdfs/outsourcing_invoice_pdf.rb

SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2  [["id", 86], ["LIMIT", 1]]
---
      report.page.item(:construction_name).value(construction_name)

      #得意先名
      if purchase_data_current.construction_datum.present? && purchase_data_current.construction_datum.CustomerMaster.present?