app/pdfs/purchase_order_and_estimate_pdf.rb

SELECT "supplier_responsibles".* FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1  [["supplier_master_id", 2]]
---
    #report.page.item(:supplier_responsible_name).value($quotation_material_header.supplier_master.responsible1 + "様")
    #担当は先頭を取ってくる---複数の場合に無理があるかも??
    #report.page.item(:supplier_responsible_name).value($quotation_material_header.supplier_master.supplier_responsibles[0].responsible_name + "様")
    if @quotation_material_header.supplier_master.supplier_responsibles[0].present?  #upd231111