app/pdfs/purchase_list_pdf.rb

SELECT purchase_data.*, purchase_order_data.purchase_order_code FROM "purchase_data" INNER JOIN "construction_data" ON "construction_data"."id" = "purchase_data"."construction_datum_id" INNER JOIN "purchase_order_data" ON "purchase_order_data"."id" = "purchase_data"."purchase_order_datum_id" WHERE (construction_data.id = '2649') ORDER BY purchase_order_data.purchase_order_code, purchase_data.purchase_date, purchase_data.id
---
    #postgreSQL仕様
    #$purchase_data.joins(:purchase_order_datum).select("purchase_data.*, purchase_order_data.*").order("purchase_order_data.purchase_order_code, purchase_data.purchase_date, purchase_data.id").each do |purchase_datum|
    #upd230919
    $purchase_data.joins(:purchase_order_datum).select("purchase_data.*, purchase_order_data.purchase_order_code").order("purchase_order_data.purchase_order_code, purchase_data.purchase_date, purchase_data.id").each do |purchase_datum|

SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2
---
          report.page.item(:construction_name).value(purchase_datum.construction_datum.construction_name)
        end
        if $customer_flag == true
          report.page.item(:customer_name).value(purchase_datum.construction_datum.CustomerMaster.customer_name)

SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2
---
        else
          #if purchase_datum.MaterialMaster.material_code != "＜手入力用＞"
          #upd230719
          if purchase_datum.MaterialMaster.present? &&  purchase_datum.MaterialMaster.material_code != "＜手入力用＞"

SELECT "purchase_divisions".* FROM "purchase_divisions" WHERE "purchase_divisions"."id" = $1 LIMIT $2
---
        if purchase_datum.inventory_division_id.present? && InventoryHistory.inventory_division[purchase_datum.inventory_division_id.to_i][1] == 0
          division_name = InventoryHistory.inventory_division[purchase_datum.inventory_division_id.to_i][0]
        else
          if purchase_datum.PurchaseDivision.present?  #add230701