app/pdfs/purchase_list_addition_pdf.rb

  def self.create(purchase_list, company_id, changed_item, changed_quantity, changed_amount)
	  #仕入表(積算用)PDF発行

    # tlfファイルを読み込む
    report = Thinreports::Report.new(layout: "#{Rails.root}/app/pdfs/purchase_list_pdf.tlf")

    # 1ページ目を開始
    report.start_new_page

    # テーブルの値を設定
    # list に表のIDを設定する(デフォルトのID値: default)
    # add_row で列を追加できる
    # ブロック内のrow.valuesで値を設定する

    @flag = nil

    #初期化
    @purchase_order_code  = ""
    @purchase_amount_subtotal = 0
    @purchase_amount_total = 0

    #ヘッダの線の色を変える(アデュース仕様)
    #del240410
    #if company_id == 1
    #  report.page.item(:line_3).style(:border_color, 'red')
    #end

    #タイトル
    report.page.item(:print_title).value("仕入表(積算)")

    $purchase_data.joins(:purchase_order_datum).select("purchase_data.*, purchase_order_data.purchase_order_code").order("purchase_order_data.purchase_order_code, purchase_data.purchase_date, purchase_data.id").each do |purchase_datum|
---
SELECT purchase_data.*, purchase_order_data.purchase_order_code FROM "purchase_data" INNER JOIN "construction_data" ON "construction_data"."id" = "purchase_data"."construction_datum_id" INNER JOIN "purchase_order_data" ON "purchase_order_data"."id" = "purchase_data"."purchase_order_datum_id" WHERE (construction_data.id = '2774') AND "purchase_data"."purchase_order_datum_id" = 4078 ORDER BY purchase_order_data.purchase_order_code, purchase_data.purchase_date, purchase_data.id

          report.page.item(:construction_name).value(purchase_datum.construction_datum.construction_name)
        end
        if $customer_flag == true
          report.page.item(:customer_name).value(purchase_datum.construction_datum.CustomerMaster.customer_name)
---
SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2

        else
          #if purchase_datum.MaterialMaster.material_code != "＜手入力用＞"
          #upd230719
          if purchase_datum.MaterialMaster.present? &&  purchase_datum.MaterialMaster.material_code != "＜手入力用＞"
---
SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2

        if purchase_datum.inventory_division_id.present? && InventoryHistory.inventory_division[purchase_datum.inventory_division_id.to_i][1] == 0
          division_name = InventoryHistory.inventory_division[purchase_datum.inventory_division_id.to_i][0]
        else
          if purchase_datum.PurchaseDivision.present?  #add230701
---
SELECT "purchase_divisions".* FROM "purchase_divisions" WHERE "purchase_divisions"."id" = $1 LIMIT $2