app/pdfs/purchase_list_pdf.rb


    if purchase_list.blank? && construction_id.present?
      storage_inventory_histories = StorageInventoryHistory.where(construction_datum_id: construction_id)
      if storage_inventory_histories.present?
---
SELECT "storage_inventory_histories".* FROM "storage_inventory_histories" WHERE "storage_inventory_histories"."construction_datum_id" = $1

      #upd230919
      #$purchase_data.joins(:purchase_order_datum).select("purchase_data.*, purchase_order_data.purchase_order_code").order("purchase_order_data.purchase_order_code, purchase_data.purchase_date, purchase_data.id").each do |purchase_datum|
      #upd240522
      purchase_list.joins(:purchase_order_datum).select("purchase_data.*, purchase_order_data.purchase_order_code").order("purchase_order_data.purchase_order_code, purchase_data.purchase_date, purchase_data.id").each do |purchase_datum|
---
SELECT purchase_data.*, purchase_order_data.purchase_order_code FROM "purchase_data" INNER JOIN "construction_data" ON "construction_data"."id" = "purchase_data"."construction_datum_id" INNER JOIN "purchase_order_data" ON "purchase_order_data"."id" = "purchase_data"."purchase_order_datum_id" WHERE (construction_data.id = '2797') ORDER BY purchase_order_data.purchase_order_code, purchase_data.purchase_date, purchase_data.id

            @construction_datum_id = purchase_datum.construction_datum_id
          end
          if $customer_flag == true
            @report.page.item(:customer_name).value(purchase_datum.construction_datum.CustomerMaster.customer_name)
---
SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2

          else
            #if purchase_datum.MaterialMaster.material_code != "＜手入力用＞"
            #upd230719
            if purchase_datum.MaterialMaster.present? &&  purchase_datum.MaterialMaster.material_code != "＜手入力用＞"
---
SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2

          if purchase_datum.inventory_division_id.present? && InventoryHistory.inventory_division[purchase_datum.inventory_division_id.to_i][1] == 0
            division_name = InventoryHistory.inventory_division[purchase_datum.inventory_division_id.to_i][0]
          else
            if purchase_datum.PurchaseDivision.present?  #add230701
---
SELECT "purchase_divisions".* FROM "purchase_divisions" WHERE "purchase_divisions"."id" = $1 LIMIT $2

    #支給品用処理追加　add240515
    if @construction_datum_id.present?

      @storage_inventory_histories = StorageInventoryHistory.where(construction_datum_id: @construction_datum_id)
---
SELECT "storage_inventory_histories".* FROM "storage_inventory_histories" WHERE "storage_inventory_histories"."construction_datum_id" = $1

          #@construction_datum_id = purchase_datum.construction_datum_id
        end
        if $customer_flag == true
          @report.page.item(:customer_name).value(storage_inventory_history.construction_datum.CustomerMaster.customer_name)
---
SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2

        #単位名
        unit_name = "-"
        if storage_inventory_history.material_master.present?
          unit_master = UnitMaster.where(id: storage_inventory_history.material_master.unit_id).first
---
SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2
SELECT "unit_masters".* FROM "unit_masters" WHERE "unit_masters"."id" = $1 ORDER BY "unit_masters"."id" ASC LIMIT $2