app/pdfs/storage_inventory_history_list_pdf.rb

SELECT storage_inventory_histories.*, purchase_order_data.purchase_order_code FROM "storage_inventory_histories" INNER JOIN "construction_data" ON "construction_data"."id" = "storage_inventory_histories"."construction_datum_id" INNER JOIN "purchase_order_data" ON "purchase_order_data"."id" = "storage_inventory_histories"."purchase_order_datum_id" WHERE (construction_data.id = '2798') ORDER BY storage_inventory_histories.purchase_order_datum_id, storage_inventory_histories.occurred_date, storage_inventory_histories.id
---
  def self.create(storage_inventory_histories)

    #初期化
    @flag = nil
    @purchase_order_code  = ""
    @purchase_amount_subtotal = 0
    @purchase_amount_total = 0

     # 1ページ目を開始
    #@report.start_new_page layout: "#{Rails.root}/app/pdfs/purchase_list_pdf.tlf"
    @report = Thinreports::Report.new(layout: "#{Rails.root}/app/pdfs/purchase_list_pdf.tlf")

    # 1ページ目を開始
    @report.start_new_page

    #タイトル
    @report.page.item(:lbl_storage_inventory).visible(true)
    @report.page.item(:print_title).value("仕入表")

    storage_inventory_histories.joins(:purchase_order_datum).select("storage_inventory_histories.*, purchase_order_data.purchase_order_code").
          order("storage_inventory_histories.purchase_order_datum_id, storage_inventory_histories.occurred_date, storage_inventory_histories.id").each do |storage_inventory_history|

SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2
---
        #end

        #if $customer_flag == true
          @report.page.item(:customer_name).value(storage_inventory_history.construction_datum.CustomerMaster.customer_name)

SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2
SELECT "unit_masters".* FROM "unit_masters" WHERE "unit_masters"."id" = $1 ORDER BY "unit_masters"."id" ASC LIMIT $2
---
        #単位名
        unit_name = "-"
        if storage_inventory_history.material_master.present?
          unit_master = UnitMaster.where(id: storage_inventory_history.material_master.unit_id).first
          if unit_master.present?