app/pdfs/warehouse_and_delivery_list_pdf.rb


        maker_name = ""
        #upd230720
        if inventory_history.material_master.MakerMaster.present?
---
SELECT "maker_masters".* FROM "maker_masters" WHERE "maker_masters"."id" = $1 LIMIT $2