app/views/invoice_headers/index.html.erb

  <%= f.label :invoice_code, '請求Ｎｏ：' %>
  <%= f.select :id_eq, InvoiceHeader.all.map{|st| [st.invoice_code, st.id]}, {include_blank: true}, {style: 'width:220px' , class: "searchableInvoiceCode" } %>
---
SELECT "invoice_headers".* FROM "invoice_headers"

  <%= f.label :construction_code, '件名：' %>
  <!--<%= f.select :with_id, options_from_collection_for_select(InvoiceHeader.all, "id", "construction_name") , {include_blank: true}, {style: 'width:440px' , class: "searchableConstructionName" } %></br>-->
  <%= f.select :with_id, InvoiceHeader.all.map{|st| [st.construction_name, st.id]}, {include_blank: true}, {style: 'width:440px' , class: "searchableConstructionName" } %>
---
SELECT "invoice_headers".* FROM "invoice_headers"

  <%= f.label :customer_name, '得意先：' %>
  <%= f.select :customer_id_eq, InvoiceHeader.all.select(:customer_name, :customer_id).uniq.map{|st| [st.customer_name, st.customer_id]}, {include_blank: true}, {style: 'width:440px' , class: "searchableCustomerName" } %>
---
SELECT "invoice_headers"."customer_name", "invoice_headers"."customer_id" FROM "invoice_headers"