app/views/outsourcing_data/_form.html.erb

SELECT "purchase_unit_prices".* FROM "purchase_unit_prices"
SELECT "unit_masters".* FROM "unit_masters"
SELECT "supplier_masters".* FROM "supplier_masters"
---
  <% else %>
    <%= f.collection_select :supplier_id, SupplierMaster.all, :id, :supplier_name, {:prompt => "どれか一つを選択して下さい"},
      {id:"supplier_id", :class => "searchableSupplier", style: 'width:220px', :tabindex=>"5", :onchange => "setUnitPrice(this.form)"}  %>

SELECT "purchase_unit_prices".* FROM "purchase_unit_prices"
---
  <%= f.label :仕入先品番（検索用） , {:class => "my-custom-class-l"} %>
  <%= f.collection_select :supplier_material_code, PurchaseUnitPrice.all, :id, :supplier_material_code, {:include_blank => true} ,
      {id:"supplier_material_id", class: "searchableSupplierItem" , style: 'width:220px', :tabindex=>"7"} %>

SELECT "material_masters".* FROM "material_masters"
---
  <%= f.label :定価参照, {:class => "my-custom-class-lr2"} %>
  <%= f.collection_select :lstListPrice, MaterialMaster.all,  :id, :list_price,  {:prompt => "どれか一つを選択して下さい",:selected => @purchase_datum.material_id} ,
          {id:'material_list_price', :class => "my-custom-class-r2", style: 'font-size : 12px;width:100px'}  %></br>

SELECT "material_masters".* FROM "material_masters"
---
  <!--<%= f.label :品名 , {:class => "my-custom-class-l"} %></br>-->
  <!--<%= f.collection_select :material_name, MaterialMaster.all,  :id, :material_name,  {:prompt => "どれか一つを選択して下さい",:selected => @purchase_datum.material_id} , {name: 'lstMaterialName' ,:class => "my-custom-class-r"}  %></br>-->

SELECT "maker_masters".* FROM "maker_masters"
---
  <%= f.label :メーカー, {:class => "my-custom-class-l"} %></br>
  <%= f.collection_select :maker_id, MakerMaster.all, :id, :maker_name,  {:prompt => "どれか一つを選択して下さい"} ,
       { id:'maker_id', class: "searchableMaker" , :tabindex=>"11", style: 'width:220px'} %></br>

SELECT "unit_masters".* FROM "unit_masters"
---
    <%= f.label :単位, {:class => "my-custom-class-l"}  %></br>
    <%= f.collection_select :unit_id, UnitMaster.all,:id, :unit_name, {:selected => @purchase_datum.unit_id || 3 } , {id:"unit_id", :tabindex=>"14" , style: 'width:110px;' , :class => "searchableUnit"} %>

SELECT "material_categories".* FROM "material_categories"
---
    <%= m.label :"資材分類" , {:class => "my-custom-class-l"} %></br>
    <%= m.collection_select :material_category_id, MaterialCategory.all, :id, :name, {:include_blank => true} , {id:"material_category_id", class: "searchableCategory" ,
               style: 'width:220px;', :selected => 0 } %>

SELECT "purchase_divisions".* FROM "purchase_divisions"
---
  <%= f.label :仕入区分 , {:class => "my-custom-class-l", style: 'width:190px;'} %><%= f.label :入出庫区分 , {:class => "my-custom-class-l"} %></br>
  <%= f.collection_select :division_id, PurchaseDivision.all, :id, :purchase_division_name ,
      {:selected => @purchase_datum.division_id || 1, :prompt => "どれか一つを選択して下さい"} ,
      {id: "division_id", :tabindex=>"19", style: 'width:120px;', :onchange => "uncheckUnitPrice()", :class => "my-custom-class"} %>