app/views/outsourcing_data/index.html.erb

  <%= f.label :supplier_id, '外注先：：' %>
  <!--<%= f.select :supplier_id_eq, options_from_collection_for_select(SupplierMaster.all, "id","supplier_name" ) , {include_blank: true}, {style: 'width:220px' , class: "searchableSupplierName" } %> -->
---
SELECT "supplier_masters".* FROM "supplier_masters"

  <!--<%= f.label :maker_code, 'メーカー：：' %>
  <%= f.select :maker_id_eq, MakerMaster.all.map{|st| [st.maker_name, st.id]}, {include_blank: true}, {style: 'width:220px' , class: "searchableMakerName" } %>
---
SELECT "maker_masters".* FROM "maker_masters"

  <%= f.label :division_id, '仕入区分' %>
  <%= f.select :division_id_eq, PurchaseDivision.all.map{|st| [st.purchase_division_name, st.id]}, {include_blank: true},
       { id: 'division_id', style: 'width:120px' , class: "searchablePurchaseDivision"}  %>
---
SELECT "purchase_divisions".* FROM "purchase_divisions"

  <%= f.label :customer_id, '得意先：：' %>
  <!--<%= f.select :with_customer, options_from_collection_for_select(CustomerMaster.all, "id", "customer_name") , {include_blank: true}, {style: 'width:220px' , class: "searchableCustomerName" }  %>-->
---
SELECT "customer_masters".* FROM "customer_masters"

        <% end %>
        <% if purchase_datum.construction_datum_id.present? && purchase_datum.construction_datum.present? &&
                purchase_datum.construction_datum.CustomerMaster.present? %>
---
SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2

        <% end %>
		<% if purchase_datum.material_id != 1 && purchase_datum.MaterialMaster.present? %>
---
SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2

        <% end %>
        <% if purchase_datum.SupplierMaster.present? %>
---
SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2


		<% if purchase_datum.PurchaseDivision.present? %>
---
SELECT "purchase_divisions".* FROM "purchase_divisions" WHERE "purchase_divisions"."id" = $1 LIMIT $2