app/views/outsourcing_data/show.html.erb

  <dt><strong>分類</strong></dt>
  <% if @purchase_datum.MaterialMaster.material_category.present? %>
---
SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2

  <dt><strong>仕入業者</strong></dt>
  <% if @purchase_datum.SupplierMaster.present? %>
---
SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2