app/views/construction_costs/index.html.erb

  <tbody>
    <% @construction_costs.joins(:construction_datum).select("construction_costs.*, construction_data.construction_code").order("construction_data.construction_code desc").each do |construction_cost| %>
---
SELECT construction_costs.*, construction_data.construction_code FROM "construction_costs" INNER JOIN "construction_data" ON "construction_data"."id" = "construction_costs"."construction_datum_id" ORDER BY construction_data.construction_code desc LIMIT $1 OFFSET $2