app/views/purchase_order_histories/_order_fields.html.erb

  <!--idを入れるとRails6でselect2が正常動作しないので注意!!([id:"unit_master_id"]は削除)-->
  <%= f.collection_select :unit_master_id, @unit_masters.all, :id, :unit_name, {:selected => f.object.unit_master_id || 3} ,
        { class: "searchableSelect1_2" , style: 'width:50px' } %>
---
SELECT "unit_masters".* FROM "unit_masters"

  <!--タブ移動はjs側の”setNextControl”で制御-->
  <% @notes = MaterialMaster.where(:id => f.object.material_id).where("id is NOT NULL").pluck(:notes).flatten.join(" ") %>
---
SELECT "material_masters"."notes" FROM "material_masters" WHERE "material_masters"."id" IS NULL AND (id is NOT NULL)

  <!--idを入れるとRails6でselect2が正常動作しないので注意!!([id:"material_category_id"]は削除)-->
  <%= f.collection_select :material_category_id, @material_categories.all, :id, :name, {:include_blank => true, :selected => f.object.material_category_id || nil} ,
      {class: "searchableSelect1_4 form-control" , style: 'width:200px;margin-left:-20px', :tabindex => "6" } %>
---
SELECT "material_categories".* FROM "material_categories"