app/views/purchase_order_histories/index2.html.erb

    <!--<%= f.label :material_code, '品番：' %>-->
    <!--<%= f.select :material_code_eq, options_from_collection_for_select(MaterialMaster.all, "id", "material_code") , {include_blank: true}, {style: 'width:220px' , class: "searchablePurchaseOrderCode" } %>-->
---
SELECT "material_masters".* FROM "material_masters"

  <tbody>
    <% @orders.order("id desc").each do |orders| %>
---
SELECT "orders".* FROM "orders" INNER JOIN "purchase_order_histories" ON "purchase_order_histories"."id" = "orders"."purchase_order_history_id" WHERE (purchase_order_histories.purchase_order_datum_id = 3897) AND (orders.purchase_order_history_id = purchase_order_histories.id) ORDER BY id desc LIMIT $1 OFFSET $2

        <td><%= orders.material_name %></td>
        <% if orders.material_master.present? && orders.material_master.MakerMaster.present? %>
---
SELECT "maker_masters".* FROM "maker_masters" WHERE "maker_masters"."id" = $1 LIMIT $2