app/views/construction_data/_form.html.erb

SELECT "quotation_headers".* FROM "quotation_headers"
---
  <%= f.label :"見積書コード" , {:class => "my-custom-class-l"} %></br>
  <%= f.collection_select :quotation_header_id, QuotationHeader.all, :id, :quotation_code, {:include_blank => true} ,
  {id:"quotation_header_id", :onchange => "setConstructionDefaultAjax()", class: "searchableSelect2_1" , style: 'width:150px' } %>

SELECT "delivery_slip_headers".* FROM "delivery_slip_headers"
---
    <%= f.label :"納品書コード" , {:class => "my-custom-class-l"} %></br>
    <%= f.collection_select :delivery_slip_header_id, DeliverySlipHeader.all, :id, :delivery_slip_code, {:include_blank => true} ,
       {id:"delivery_slip_header_id", :onchange => "setConstructionDefaultAjaxD()", class: "searchableSelect2_2" , style: 'width:150px' } %>

SELECT "sites".* FROM "sites"
---
  <%= f.label :"現場名" , {:class => "my-custom-class-l"} %></br>
  <%= f.collection_select :site_id, Site.all, :id, :name, {:include_blank => true} ,
  {id:"construction_site_id", :tabindex=>"5", class: "searchInsertSite" , style: 'width:450px' } %>

SELECT "customer_masters".* FROM "customer_masters"
---
  <%= f.label :得意先, {:class => "my-custom-class-l" }  %></br>
  <%= f.collection_select :customer_id, CustomerMaster.all, :id, :customer_name, {:prompt => "どれか一つを選択して下さい"} , {id:"customer_id", :tabindex=>"7", class: "searchableCustomerName" , style: 'width:330px' } %>