app/views/construction_data/index.html.erb

	<%= f.label :customer_name, '得意先名　' %>
    <!--<%= f.select :customer_id_eq, options_from_collection_for_select(CustomerMaster.all, "id", "customer_name") , {include_blank: true}, {style: 'width:330px' , class: "searchableCustomerName" } %>-->
    <%= f.select :customer_id_eq, CustomerMaster.all.map{|st| [st.customer_name, st.id]}, {include_blank: true}, {id: 'customer_id', style: 'width:330px' ,
	     class: "searchableCustomerName", :onchange => "setConstructionExtractByCutomer()" } %>
---
SELECT "customer_masters".* FROM "customer_masters"


        <% @search = ConstructionCost.find_by(:construction_datum_id => construction_datum.id) %>
---
SELECT "construction_costs".* FROM "construction_costs" WHERE "construction_costs"."construction_datum_id" = $1 LIMIT $2  [["construction_datum_id", 2691], ["LIMIT", 1]]

            <!--red500-->
            <td><%= link_to t('.edit', :default => t("集計")),
                      edit_construction_cost_path(ConstructionCost.where(construction_datum_id: construction_datum.id).first, construction_id: construction_datum.id,
                               move_flag: "1"), :class => 'btn btn-black_ftg btn-xs keep-disp', :style => "width: 50px; height: 10px;" %></td>
---
SELECT "construction_costs".* FROM "construction_costs" WHERE "construction_costs"."construction_datum_id" = $1 ORDER BY "construction_costs"."id" ASC LIMIT $2  [["construction_datum_id", 2691], ["LIMIT", 1]]

		        <!-- old lime500-->
            <td><%= link_to t('.edit', :default => t("集計")),
                      edit_construction_cost_path(ConstructionCost.where(construction_datum_id: construction_datum.id).first, construction_id: construction_datum.id,
                               move_flag: "1"), :class => 'btn btn-white_ftg btn-xs keep-disp', :style => "width: 50px; height: 10px;" %></td>
---
SELECT "construction_costs".* FROM "construction_costs" WHERE "construction_costs"."construction_datum_id" = $1 ORDER BY "construction_costs"."id" ASC LIMIT $2  [["construction_datum_id", 2690], ["LIMIT", 1]]


		<% if construction_datum.CustomerMaster.present? %>
---
SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2  [["id", 86], ["LIMIT", 1]]