app/views/purchase_order_data/_form.html.erb

SELECT "supplier_masters".* FROM "supplier_masters"
---
  <%= f.label :仕入先 , {:class => "my-custom-class-l"} %></br>
  <%= f.collection_select :supplier_master_id, SupplierMaster.all, :id, :supplier_name, {}, {id:"supplier_master_id", class: "searchableSupplier" , style: 'width:430px', :tabindex=>"6"} %></br></br>

SELECT "supplier_responsibles".* FROM "supplier_responsibles"
---
    <%= f.label :担当者 , {:class => "my-custom-class-l"} %></br>
    <!--<%= f.collection_select :supplier_responsible_id, SupplierResponsible.all, :id, :responsible_name, {:include_blank => true},
                 {id:"supplier_responsible_id", class: "searchableResponsible" , style: 'width:220px', :tabindex=>"8"} %>-->