app/views/purchase_order_data/index.html.erb

SELECT "supplier_masters".* FROM "supplier_masters" ORDER BY "supplier_masters"."id" ASC
---
      <%= f.label :supplier_master_id, '仕入先：：' %>
      <%= f.select :supplier_master_id_eq, SupplierMaster.all.map{|st| [st.supplier_name, st.id]}, {include_blank: true}, {style: 'width:220px' , class: "searchableSupplierName" } %>