app/views/working_subcategories/index.html.erb

    <%= f.label :working_category_id, 'カテゴリー(主)：：' %>
    <%= f.select :working_category_id_eq, WorkingCategory.all.map{|st| [st.category_name, st.id]},
           {include_blank: true}, {style: 'width:220px' , class: "searchableCategory"}  %>
---
SELECT "working_categories".* FROM "working_categories"