app/helpers/sessions_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2
---
  def current_user
    if session[:user_id]
     #@current_user = @current_user || User.find_by(id: session[:user_id])と同じ意味
      @current_user ||= User.find_by(id: session[:user_id])