app/views/purchase_headers/index.html.erb

SELECT "purchase_headers".* FROM "purchase_headers"
---
   <%= f.label :slip_code, '伝票番号：' %>
   <%= f.select :id_eq, PurchaseHeader.all.map{|st| [st.slip_code, st.id]}, {include_blank: true}, {style: 'width:220px' , class: "searchableSlipCode" } %>