app/views/supplier_masters/index.html.erb

    <%= f.label :supplier_name, '仕入先名：' %>
    <%= f.select :id_eq, options_from_collection_for_select(SupplierMaster.all, "id", "supplier_name") , {include_blank: true}, {style: 'width:220px' , class: "searchableSupplierName" } %>
---
SELECT "supplier_masters".* FROM "supplier_masters"

        <% cnt = 0 %>
        <% supplier_master.supplier_responsibles.first(3).each do |rp| %>
---
SELECT "supplier_responsibles".* FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1 ORDER BY "supplier_responsibles"."id" ASC LIMIT $2