app/views/supplier_masters/show.html.erb

  <% cnt = 0 %>
  <% @supplier_master.supplier_responsibles.first(3).each do |rp| %>
---
SELECT "supplier_responsibles".* FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1 ORDER BY "supplier_responsibles"."id" ASC LIMIT $2