app/views/customer_masters/index.html.erb

SELECT "customer_masters".* FROM "customer_masters"
---
    <%= f.label :customer_name, '得意先名：' %>
    <%= f.select :id_eq, options_from_collection_for_select(CustomerMaster.all, "id", "customer_name") , {include_blank: true}, {style: 'width:330px' , class: "searchableCustomerName" } %>