app/views/stocktakes/_form.html.erb

SELECT "material_masters".* FROM "material_masters"
---
  <%= f.label :material_name , {:class => "my-custom-class-l"} %></br>
  <!--<%= f.collection_select :material_master_id, MaterialMaster.all, :id, :p_material_code_name, {:prompt => "どれか一つを選択して下さい"} , {id:"material_master_id",
  class: "searchableSelect2_1" , style: 'width:440px' } %>-->