app/views/invoice_detail_large_classifications/_index.html.erb

SELECT "invoice_headers".* FROM "invoice_headers"
---
      <!--add230720-->
      <% if invoice_detail_large_classification.InvoiceHeader.present? && invoice_detail_large_classification.InvoiceHeader.construction_name.present? %>