app/views/invoice_detail_large_classifications/index.html.erb

  <%= f.label :construction_code, '請求Ｎｏ　' %>
  <%= f.select :invoice_header_id_eq, options_from_collection_for_select(InvoiceHeader.all, "id", "invoice_code") , {include_blank: true}, {style: 'width:220px' , class: "searchableInvoiceCode" } %>
  <%= f.label :construction_code, '件名　' %>
  <%= f.select :with_header_id, options_from_collection_for_select(InvoiceHeader.all, "id", "construction_name") , {include_blank: true}, {style: 'width:220px' , class: "searchableConstructionName" } %></br>
  <%= f.label :working_large_item, '品目名　' %>
  <%= f.select :working_large_item_name_eq, options_from_collection_for_select(InvoiceDetailLargeClassification.
                  select(:id, :working_large_item_name).group(:id, :working_large_item_name), "working_large_item_name","working_large_item_name" ) , {include_blank: true}, {style: 'width:220px' , class: "searchableLargeItem" } %></br>
---
SELECT "invoice_headers".* FROM "invoice_headers"
SELECT "invoice_detail_large_classifications"."id", "invoice_detail_large_classifications"."working_large_item_name" FROM "invoice_detail_large_classifications" GROUP BY "invoice_detail_large_classifications"."id", "invoice_detail_large_classifications"."working_large_item_name"