app/views/delivery_slip_detail_large_classifications/index.html.erb

SELECT "delivery_slip_headers".* FROM "delivery_slip_headers"
---
  <%= f.label :construction_code, '納品Ｎｏ　' %>
  <%= f.select :delivery_slip_header_id_eq, options_from_collection_for_select(DeliverySlipHeader.all, "id", "delivery_slip_code") , {include_blank: true}, {style: 'width:220px' , class: "searchableDeliverySlipCode" } %>

SELECT "delivery_slip_detail_large_classifications"."id", "delivery_slip_detail_large_classifications"."working_large_item_name" FROM "delivery_slip_detail_large_classifications" GROUP BY "delivery_slip_detail_large_classifications"."id", "delivery_slip_detail_large_classifications"."working_large_item_name"
---
  <%= f.label :working_large_item, '品目名　' %>
  <%= f.select :working_large_item_name_eq, options_from_collection_for_select(DeliverySlipDetailLargeClassification.select(:id, :working_large_item_name).
                                      group(:id, :working_large_item_name), "working_large_item_name","working_large_item_name" ) , {include_blank: true}, {style: 'width:220px' , class: "searchableLargeItem" } %></br>