app/views/construction_daily_reports/_form.html.erb

  <%= f.label :作業員, {:class => "my-custom-class-l"}  %></br>
  <%= f.collection_select :staff_id, Staff.all, :id, :staff_name, {:prompt => "どれか一つを選択して下さい" } , {id:"staff_id", class: "my-custom-class" ,
  :tabindex=>"2", :onchange=> "getDailyPay(this.form)" }  %>
---
SELECT "staffs".* FROM "staffs" WHERE (is_resign is null or is_resign = 0)

  <!--所属 add170707 -->
  <!--<%= f.collection_select :affiliation_id, Staff.all, :id, :affiliation_id,
         {:selected => @construction_daily_report.staff_id} , { id:"affiliation_id" }%>-->
---
SELECT "staffs".* FROM "staffs"