app/views/quotation_material_headers/_quotation_material_detail_fields.html.erb

SELECT "unit_masters".* FROM "unit_masters"
---
  <td>&nbsp;&nbsp;</td>
  <!--<%= f.collection_select :unit_master_id, @unit_masters.all, :id, :unit_name, {:selected => f.object.unit_master_id || 3} ,
     { id: "unit_master_id", name:"unit_master_id[]", class: "searchableSelect1_2" , style: 'width:50px' } %>-->
  <%= f.collection_select :unit_master_id, @unit_masters.all, :id, :unit_name, {:selected => f.object.unit_master_id || 3} ,
     { class: "searchableSelect1_2 form-control" , style: 'width:50px' } %>

SELECT "material_masters"."notes" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)  [["id", 495]]
---
  <!--タブ移動はjs側の”setNextControl”で制御-->
  <% @notes = MaterialMaster.where(:id => f.object.material_id).where("id is NOT NULL").pluck(:notes).flatten.join(" ") %>

SELECT "material_masters".* FROM "material_masters"
---
  &nbsp;&nbsp;&nbsp;&nbsp;
  <% if f.object.material_master.present? %>

SELECT "material_categories".* FROM "material_categories"
---
  <!--idを入れるとRails6でselect2が正常動作しないので注意!!([id:"material_category_id"]は削除)-->
  <%= f.collection_select :material_category_id, MaterialCategory.all, :id, :name,
      {:include_blank => true, :selected => @material_category_id} ,
      {class: "searchableSelect1_4 form-control" , style: 'width:200px;margin-left:-20px'} %>