app/views/quotation_material_headers/index.html.erb

SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2
---
		<% if quotation_material_header.supplier_id_1.present? %>
		  <% @supplier_1 = SupplierMaster.find(quotation_material_header.supplier_id_1).supplier_name %>

SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2
---
		<% if quotation_material_header.supplier_id_2.present? %>
		  <% @supplier_2 = SupplierMaster.find(quotation_material_header.supplier_id_2).supplier_name %>

SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2
---
		<% if quotation_material_header.supplier_id_3.present? %>
		  <% @supplier_3 = SupplierMaster.find(quotation_material_header.supplier_id_3).supplier_name %>