app/controllers/application_controller.rb

  def app_set_responsible(param_responsible, param_email, param_supplier)

    #supplier_update_flag = nil
    supplier_responsible = nil

    @supplier_responsible_id = 0

    #$responsible = nil
    #$email_responsible = nil

    @responsible = nil
    @email_responsible = nil

    if param_responsible.to_i > 0
      #担当者選択した場合
      supplier_responsible = SupplierResponsible.where(id: param_responsible).first
---
SELECT "supplier_responsibles".* FROM "supplier_responsibles" WHERE "supplier_responsibles"."id" = $1 ORDER BY "supplier_responsibles"."id" ASC LIMIT $2

  def app_get_session_user

    #ここでUser別に帳票を切り分ける処理を行う。
    user = User.where("id = ?" , session[:user_id]).first
---
SELECT "users".* FROM "users" WHERE (id = 1) ORDER BY "users"."id" ASC LIMIT $1