app/controllers/business_holidays_controller.rb

SELECT "business_holidays".* FROM "business_holidays" WHERE "business_holidays"."working_date" = $1 ORDER BY "business_holidays"."id" ASC LIMIT $2
---
  def get_business_holiday
    if params[:working_date].present?  #add230622
      business_holiday_record  = BusinessHoliday.where(:working_date => params[:working_date]).first