app/controllers/construction_daily_reports_controller.rb

SELECT "working_times".* FROM "working_times" ORDER BY "working_times"."id" ASC LIMIT $1
---
  def get_working_time
    #各種作業時間を取得

    working_time = WorkingTime.first

    #勤務時間を取得
    if working_time.present?
      @working_time_start_time = time_to_seconds(working_time.working_time_start_time.hour,
                                               working_time.working_time_start_time.min)
    else
      @working_time_start_time = 0  #デフォルト時間必要か??
    end

    if working_time.present?
      @working_time_end_time = time_to_seconds(working_time.working_time_end_time.hour,
                                               working_time.working_time_end_time.min)
    else
      @working_time_end_time = 0
    end

    #working_time = working_time_end_time - working_time_start_time

    #休憩時間を取得
    if working_time.present?
      @break_time_1_start_time = time_to_seconds(working_time.break_time_1_start_time.hour,
                                               working_time.break_time_1_start_time.min)
    else
      @break_time_1_start_time = 0
    end

    if working_time.present?