app/controllers/construction_data_controller.rb

    #kaminari用設定
    @construction_data  = @construction_data .page(params[:page])

    @customer_masters = CustomerMaster.all
---
SELECT "customer_masters".* FROM "customer_masters"