app/controllers/construction_costs_controller.rb

SELECT "invoice_headers".* FROM "invoice_headers" WHERE "invoice_headers"."construction_datum_id" = $1 ORDER BY "invoice_headers"."id" ASC LIMIT $2
SELECT "delivery_slip_headers".* FROM "delivery_slip_headers" WHERE "delivery_slip_headers"."construction_datum_id" = $1 ORDER BY "delivery_slip_headers"."id" ASC LIMIT $2
---
  def set_final_return_divsion

    final_return_division_s = params[:construction_cost][:final_return_division]

    #if final_return_division_s.present? && final_return_division_s.to_i > 0
    if final_return_division_s.present?
      construction_datum_id = params[:construction_cost][:construction_datum_id].to_i
      final_return_division = final_return_division_s.to_i

      #請求書見出に工事番号が存在すれば区分更新
      invoiceExist = false

      invoice_header = InvoiceHeader.where(:construction_datum_id => construction_datum_id).first
      if invoice_header.present?
        invoice_header.final_return_division = final_return_division
        invoice_header.save!(:validate => false)

        invoiceExist = true
      end
      #

      #納品書見出に工事番号が存在すれば区分更新
      delivery_slip_header = DeliverySlipHeader.where(:construction_datum_id => construction_datum_id).first
      if delivery_slip_header.present?

SELECT SUM("construction_daily_reports"."labor_cost") FROM "construction_daily_reports" WHERE "construction_daily_reports"."construction_datum_id" = $1
SELECT "construction_costs"."labor_cost" FROM "construction_costs" WHERE "construction_costs"."construction_datum_id" = $1
---
  def construction_labor_cost_select


       @construction_labor_cost_origin = ConstructionDailyReport.where(:construction_datum_id => params[:construction_datum_id]).sum(:labor_cost)
       @construction_labor_cost = ConstructionCost.where(:construction_datum_id => params[:construction_datum_id]).pluck(:labor_cost).flatten.join(" ")

SELECT "construction_costs"."supplies_expense" FROM "construction_costs" WHERE "construction_costs"."construction_datum_id" = $1
---
  def purchase_amount_etc_select

    #仕入金額を取得
    @purchase_amount = PurchaseDatum.where(:construction_datum_id => params[:construction_datum_id]).sum(:purchase_amount)

    #消耗品を取得
    @supplies_expense = ConstructionCost.where(:construction_datum_id => params[:construction_datum_id]).pluck(:supplies_expense).flatten.join(" ")

    #諸経費を取得
    @misellaneous_expense = ConstructionCost.where(:construction_datum_id => params[:construction_datum_id]).pluck(:misellaneous_expense).flatten.join(" ")

    #請負金額を取得
    @constructing_amount = ConstructionCost.where(:construction_datum_id => params[:construction_datum_id]).pluck(:constructing_amount).flatten.join(" ")

UPDATE "construction_data" SET "calculated_flag" = $1, "updated_at" = $2 WHERE "construction_data"."id" = $3
---
  def set_caluculated_flag
     #construction_data = ConstructionDatum.find(params[:construction_datum_id])
	 if params[:construction_datum_id].present?

	   #binding.pry

	   #construction_data = ConstructionDatum.find(params[:construction_datum_id])
     #upd230721
     construction_data = ConstructionDatum.where(id: params[:construction_datum_id]).first

	   if construction_data.present?

	     construction_data_params = { calculated_flag: 1 }

	     #工事データを更新
	     construction_data.update(construction_data_params)

SELECT "construction_costs".* FROM "construction_costs" WHERE "construction_costs"."id" = $1 LIMIT $2
---
    def set_construction_cost
      @construction_cost = ConstructionCost.find(params[:id])