app/controllers/delivery_slip_detail_middle_classifications_controller.rb

  def labor_productivity_unit_total_select
    @labor_productivity_unit_total = WorkingMiddleItem.where(:id => params[:id]).where("id is NOT NULL").pluck(:labor_productivity_unit_total).flatten.join(" ")
---
SELECT "working_middle_items"."labor_productivity_unit" FROM "working_middle_items" WHERE "working_middle_items"."id" = $1 AND (id is NOT NULL)