app/controllers/delivery_slip_headers_controller.rb

SELECT "delivery_slip_headers".* FROM "delivery_slip_headers"
---
  def set_fixed
    if params[:delivery_slip_header_id].present?
      delivery_slip_header = DeliverySlipHeader.find_by(id: params[:delivery_slip_header_id])
      if delivery_slip_header.present?