app/controllers/inventories_controller.rb

  def self.destroy_history_on_differ_material(params, purchase_datum_id)
    inventory_history_before = InventoryHistory.where(purchase_datum_id: purchase_datum_id).first
---
SELECT "inventory_histories".* FROM "inventory_histories" WHERE "inventory_histories"."purchase_datum_id" = $1 ORDER BY "inventory_histories"."id" ASC LIMIT $2  [["purchase_datum_id", 18136], ["LIMIT", 1]]

  def self.set_inventory_history(params, purchase_datum)

    #仕入データIDをセット
    if params[:id].present?
      purchase_datum_id = params[:id]
    else
      #新規の場合のID取得
      purchase_datum_id = purchase_datum.id
    end

    #add230718
    #変更前と品番が異なった場合、一旦履歴を削除し在庫マスターも補填する
    destroy_history_on_differ_material(params, purchase_datum_id)
    #

    #upd200703
    ##在庫マスターのデータをここで取得
    warehouse_id = 1
    location_id = 1
    @inventory = Inventory.where(material_master_id: params[:purchase_datum][:material_id], warehouse_id: warehouse_id,
                                 location_id: location_id ).first
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."material_master_id" = $1 AND "inventories"."warehouse_id" = $2 AND "inventories"."location_id" = $3 ORDER BY "inventories"."id" ASC LIMIT $4  [["material_master_id", 1], ["warehouse_id", 1], ["location_id", 1], ["LIMIT", 1]]