app/controllers/invoice_detail_large_classifications_controller.rb

SELECT "invoice_headers".* FROM "invoice_headers" WHERE "invoice_headers"."id" IS NULL ORDER BY "invoice_headers"."id" ASC LIMIT $1
SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2
SELECT "invoice_headers".* FROM "invoice_headers" WHERE "invoice_headers"."id" = $1 ORDER BY "invoice_headers"."id" ASC LIMIT $2
---
  def get_public_flag

    $public_flag = false

    #invoice_header = InvoiceHeader.find(params[:invoice_header_id])
    #upd230720
    invoice_header = InvoiceHeader.where(id: params[:invoice_header_id]).first

    #if invoice_header.customer_master.present? #標準版仕様--
    if invoice_header.present? && invoice_header.customer_master.present? #標準版仕様--