app/controllers/invoice_headers_controller.rb

SELECT "invoice_headers".* FROM "invoice_headers" WHERE "invoice_headers"."id" = $1 LIMIT $2
---
    def set_invoice_header
      @invoice_header = InvoiceHeader.find(params[:id])