app/controllers/invoice_detail_large_classifications_controller.rb

SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2  [["id", 175], ["LIMIT", 1]]
SELECT "invoice_headers".* FROM "invoice_headers" WHERE "invoice_headers"."id" = $1 ORDER BY "invoice_headers"."id" ASC LIMIT $2  [["id", 707], ["LIMIT", 1]]
---
  def get_public_flag

    $public_flag = false

    #invoice_header = InvoiceHeader.find(params[:invoice_header_id])
    #upd230720
    invoice_header = InvoiceHeader.where(id: params[:invoice_header_id]).first

    #if invoice_header.customer_master.present? #標準版仕様--
    if invoice_header.present? && invoice_header.customer_master.present? #標準版仕様--

SELECT "invoice_headers".* FROM "invoice_headers" WHERE "invoice_headers"."id" = $1 ORDER BY "invoice_headers"."id" ASC LIMIT $2  [["id", 707], ["LIMIT", 1]]
SELECT "invoice_headers".* FROM "invoice_headers"
---
  def set_final_return_division_params
    #納品書コード有り？
    if params[:invoice_detail_large_classification][:delivery_slip_header_id].present?
      delivery_slip_header_id = params[:invoice_detail_large_classification][:delivery_slip_header_id].to_i
      delivery_slip_header = DeliverySlipHeader.where(:id => delivery_slip_header_id).first
      #納品書データに工事IDあり？
      if delivery_slip_header.present?
        if delivery_slip_header.construction_datum_id.present?
          construction_datum_id = delivery_slip_header.construction_datum_id
          construction_cost = ConstructionCost.where(:construction_datum_id => construction_datum_id).first
          #工事集計データあり？
          if construction_cost.present?
            #確定申告区分あり？
            if construction_cost.final_return_division.present? && construction_cost.final_return_division > 0
              invoice_header_id = params[:invoice_detail_large_classification][:invoice_header_id]
              invoice_header = InvoiceHeader.where(:id => invoice_header_id).first

              #請求書見出しの確定申告区分へZをセット(未入力またはゼロの場合)
              if invoice_header.present?