app/controllers/invoice_headers_controller.rb

SELECT "invoice_headers".* FROM "invoice_headers"
---
  def set_final_return_division_params

    if params[:invoice_header][:construction_datum_id].present?