app/controllers/material_masters_controller.rb

SELECT "material_masters"."id" FROM "material_masters" WHERE "material_masters"."material_code" = $1 AND (id is NOT NULL)  [["material_code", "wn100"]]
---
  def get_material_id
    @material_id = MaterialMaster.where(:material_code => params[:material_code]).where("id is NOT NULL").pluck(:id).flatten.join(" ")