app/controllers/material_masters_controller.rb

SELECT "material_masters"."id" FROM "material_masters" WHERE "material_masters"."material_code" = $1 AND (id is NOT NULL)
---
  def get_material_id
    @material_id = MaterialMaster.where(:material_code => params[:material_code]).where("id is NOT NULL").pluck(:id).flatten.join(" ")

SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2
---
    def set_material_master
      @material_master = MaterialMaster.find(params[:id])