app/controllers/outsourcing_data_controller.rb

SELECT "purchase_unit_prices".* FROM "purchase_unit_prices" WHERE (supplier_id = '3' and material_id = '1') ORDER BY "purchase_unit_prices"."supplier_id" ASC, "purchase_unit_prices"."material_id" ASC LIMIT $1
SELECT 1 AS one FROM "purchase_unit_prices" WHERE "purchase_unit_prices"."supplier_id" = $1 AND NOT ("purchase_unit_prices"."supplier_id" = 3 AND "purchase_unit_prices"."material_id" = 1) AND "purchase_unit_prices"."material_id" = $2 LIMIT $3
---
  def create_or_update_purchase_unit_prices

    if params[:purchase_datum][:supplier_id].present? && params[:purchase_datum][:material_id].present? #add230720
      @purchase_unit_prices = PurchaseUnitPrice.where(["supplier_id = ? and material_id = ?",
        params[:purchase_datum][:supplier_id], params[:purchase_datum][:material_id] ]).first
    end
    if @purchase_unit_prices.present?

SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."material_code" = $1 LIMIT $2
---
  def add_manual_input_to_masters

    if params[:purchase_datum][:material_id] == "1" &&
      params[:purchase_datum][:material_code] != "" &&
      params[:purchase_datum][:material_code] != "＜手入力用＞" &&
      params[:purchase_datum][:material_code] != "-"

      #商品CD有りのものだけ登録する(バリデーションで引っかかるため)
      @material_master = MaterialMaster.find_by(material_code: params[:purchase_datum][:material_code])

SELECT SUM("construction_daily_reports"."labor_cost") FROM "construction_daily_reports" INNER JOIN "staffs" ON "staffs"."id" = "construction_daily_reports"."staff_id" WHERE "construction_daily_reports"."construction_datum_id" = $1 AND "staffs"."supplier_master_id" = $2
SELECT MIN("construction_daily_reports"."working_date") FROM "construction_daily_reports" WHERE "construction_daily_reports"."construction_datum_id" = $1 AND "construction_daily_reports"."staff_id" = $2
SELECT MAX("construction_daily_reports"."working_date") FROM "construction_daily_reports" WHERE "construction_daily_reports"."construction_datum_id" = $1
---
    #     @construction_datum_id).where(:staff_id => staff_id).sum(:labor_cost)

    #標準版仕様--仕入(外注)先から取得する
    construction_labor_cost = ConstructionDailyReport.where(:construction_datum_id =>
         @construction_datum_id).joins(:Staff).where(staffs: { supplier_master_id: supplier_master_id }).sum(:labor_cost)


    #作業開始日を取得
    working_start_date = ConstructionDailyReport.where(:construction_datum_id =>
         @construction_datum_id).where(:staff_id => staff_id).minimum(:working_date)
    #作業終了日を取得
    #作業完了日は担当(外注)に絞らない
    @working_end_date = ConstructionDailyReport.where(:construction_datum_id =>
         @construction_datum_id).maximum(:working_date)

SELECT "outsourcing_costs".* FROM "outsourcing_costs" WHERE "outsourcing_costs"."purchase_order_datum_id" = $1 AND "outsourcing_costs"."supplier_master_id" = $2 ORDER BY "outsourcing_costs"."id" ASC LIMIT $3
---
      #outsourcing_cost = OutsourcingCost.where(:purchase_order_datum_id => @purchase_order_datum_id).
      #                     where(:staff_id => staff_id).first

      outsourcing_cost = OutsourcingCost.where(:purchase_order_datum_id => @purchase_order_datum_id).
                           where(:supplier_master_id => supplier_master_id).first

SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2
---
  def get_customer_date_info

    require "date"

    #construction = ConstructionDatum.find(@construction_datum_id)
    #upd230720
    construction = ConstructionDatum.where(id: @construction_datum_id).first

    customer = nil
    if construction.present?
      customer = CustomerMaster.find(construction.customer_id)