app/controllers/outsourcing_data_controller.rb

SELECT "purchase_unit_prices".* FROM "purchase_unit_prices" WHERE (supplier_id = '31' and material_id = '1') ORDER BY "purchase_unit_prices"."supplier_id" ASC, "purchase_unit_prices"."material_id" ASC LIMIT $1
SELECT 1 AS one FROM "purchase_unit_prices" WHERE "purchase_unit_prices"."supplier_id" = $1 AND NOT ("purchase_unit_prices"."supplier_id" = 37 AND "purchase_unit_prices"."material_id" = 1) AND "purchase_unit_prices"."material_id" = $2 LIMIT $3
UPDATE "purchase_unit_prices" SET "unit_price" = $1, "updated_at" = $2 WHERE "purchase_unit_prices"."supplier_id" = $3 AND "purchase_unit_prices"."material_id" = $4
---
  def create_or_update_purchase_unit_prices

    if params[:purchase_datum][:supplier_id].present? && params[:purchase_datum][:material_id].present? #add230720
      @purchase_unit_prices = PurchaseUnitPrice.where(["supplier_id = ? and material_id = ?",
        params[:purchase_datum][:supplier_id], params[:purchase_datum][:material_id] ]).first
    end
    if @purchase_unit_prices.present?
      #purchase_unit_prices_params = {material_id:  params[:purchase_datum][:material_id], supplier_id: params[:purchase_datum][:supplier_id],
      #                  unit_price: params[:purchase_datum][:purchase_unit_price]}
      #upd180316
      #単位も更新
      purchase_unit_prices_params = {material_id:  params[:purchase_datum][:material_id], supplier_id: params[:purchase_datum][:supplier_id],
                        unit_price: params[:purchase_datum][:purchase_unit_price], unit_id: params[:purchase_datum][:unit_id]}

      @purchase_unit_prices.update(purchase_unit_prices_params)

SELECT SUM("construction_daily_reports"."labor_cost") FROM "construction_daily_reports" INNER JOIN "staffs" ON "staffs"."id" = "construction_daily_reports"."staff_id" WHERE "construction_daily_reports"."construction_datum_id" = $1 AND "staffs"."supplier_master_id" = $2
---
    #     @construction_datum_id).where(:staff_id => staff_id).sum(:labor_cost)

    #標準版仕様--仕入(外注)先から取得する
    construction_labor_cost = ConstructionDailyReport.where(:construction_datum_id =>
         @construction_datum_id).joins(:Staff).where(staffs: { supplier_master_id: supplier_master_id }).sum(:labor_cost)

SELECT MIN("construction_daily_reports"."working_date") FROM "construction_daily_reports" INNER JOIN "staffs" ON "staffs"."id" = "construction_daily_reports"."staff_id" WHERE "construction_daily_reports"."construction_datum_id" = $1 AND "staffs"."supplier_master_id" = $2
SELECT MAX("construction_daily_reports"."working_date") FROM "construction_daily_reports" WHERE "construction_daily_reports"."construction_datum_id" = $1
---
    #working_start_date = ConstructionDailyReport.where(:construction_datum_id =>
    #     @construction_datum_id).where(:staff_id => staff_id).minimum(:working_date)
    #upd231009
    working_start_date = ConstructionDailyReport.where(:construction_datum_id =>
         @construction_datum_id).joins(:Staff).where(staffs: { supplier_master_id: supplier_master_id }).minimum(:working_date)

    #作業終了日を取得
    #作業完了日は担当(外注)に絞らない
    @working_end_date = ConstructionDailyReport.where(:construction_datum_id =>
         @construction_datum_id).maximum(:working_date)

SELECT "outsourcing_costs".* FROM "outsourcing_costs" WHERE "outsourcing_costs"."purchase_order_datum_id" = $1 AND "outsourcing_costs"."supplier_master_id" = $2 ORDER BY "outsourcing_costs"."id" ASC LIMIT $3
---
      #outsourcing_cost = OutsourcingCost.where(:purchase_order_datum_id => @purchase_order_datum_id).
      #                     where(:staff_id => staff_id).first

      outsourcing_cost = OutsourcingCost.where(:purchase_order_datum_id => @purchase_order_datum_id).
                           where(:supplier_master_id => supplier_master_id).first

UPDATE "outsourcing_costs" SET "billing_amount" = $1, "updated_at" = $2 WHERE "outsourcing_costs"."id" = $3
---
                            payment_due_date: @payment_due_date, working_start_date: working_start_date,
                            working_end_date: @working_end_date}

      outsourcing_cost.update(outsourcing_params)

SELECT "outsourcing_costs".* FROM "outsourcing_costs" WHERE "outsourcing_costs"."invoice_code" = $1 ORDER BY "outsourcing_costs"."id" ASC LIMIT $2
SELECT "outsourcing_costs".* FROM "outsourcing_costs" WHERE "outsourcing_costs"."construction_datum_id" = $1 ORDER BY "outsourcing_costs"."id" ASC LIMIT $2
---
  def set_invoice_code

    if @working_end_date.nil?
      search_date = @purchase_date
      return search_date
    end

    purchaseDate = @working_end_date.strftime("%Y%m%d")
    search_date = nil
    search_date_update = nil

    #作業日<>完了日
    differDate = false
    if @purchase_date != @working_end_date
      differDate = true
    end

    for i in 1..99 do
      num = "%02d" % i
      search_date = purchaseDate + num
      outsourcing_cost = OutsourcingCost.where(:invoice_code => search_date).first

      if outsourcing_cost.nil?

        #190930 未使用？？？
        #状況によっては、請求ナンバーを空きコードでアプデしないようにする
        if params[:action] == "update"  #アプデなら、空きコードでアップしない
          outsourcing_cost_a = OutsourcingCost.where(:construction_datum_id => params[:purchase_datum][:construction_datum_id]).first

SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2
---
  def get_customer_date_info

    require "date"

    #construction = ConstructionDatum.find(@construction_datum_id)
    #upd230720
    construction = ConstructionDatum.where(id: @construction_datum_id).first

    customer = nil
    if construction.present?
      customer = CustomerMaster.find(construction.customer_id)