app/controllers/outsourcing_data_controller.rb

SELECT "maker_masters".* FROM "maker_masters"
SELECT "purchase_divisions".* FROM "purchase_divisions"
SELECT "supplier_masters".* FROM "supplier_masters"
SELECT "customer_masters".* FROM "customer_masters"
---
    #kaminari用設定。
    @purchase_data = @purchase_data.page(params[:page])

    @maker_masters = MakerMaster.all
    @purchase_divisions = PurchaseDivision.all
    @supplier_masters = SupplierMaster.all
    @purchase_order_data = PurchaseOrderDatum.all
    @construction_data = ConstructionDatum.all
    @customer_masters = CustomerMaster.all

SELECT "purchase_unit_prices".* FROM "purchase_unit_prices" WHERE "purchase_unit_prices"."supplier_id" = $1 AND "purchase_unit_prices"."material_id" = $2 LIMIT $3  [["supplier_id", 37], ["material_id", 1], ["LIMIT", 1]]
SELECT "material_masters"."list_price" FROM "material_masters" WHERE (id = 1)
SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit

    @purchase_unit_prices = PurchaseUnitPrice.where(["supplier_id = ? and material_id = ?", @purchase_datum.supplier_id, @purchase_datum.material_id])
    @material_masters = MaterialMaster.where(["id = ?", @purchase_datum.material_id]).pluck(:list_price)
    @maker_masters = MakerMaster.where(["id = ?", @purchase_datum.material_id])

SELECT "purchase_unit_prices".* FROM "purchase_unit_prices" WHERE (supplier_id = '37' and material_id = '1') ORDER BY "purchase_unit_prices"."supplier_id" ASC, "purchase_unit_prices"."material_id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT 1 AS one FROM "purchase_unit_prices" WHERE "purchase_unit_prices"."supplier_id" = $1 AND NOT ("purchase_unit_prices"."supplier_id" = 37 AND "purchase_unit_prices"."material_id" = 1) AND "purchase_unit_prices"."material_id" = $2 LIMIT $3  [["supplier_id", 37], ["material_id", 1], ["LIMIT", 1]]
UPDATE "purchase_unit_prices" SET "unit_price" = $1, "updated_at" = $2 WHERE "purchase_unit_prices"."supplier_id" = $3 AND "purchase_unit_prices"."material_id" = $4  [["unit_price", "8500.0"], ["updated_at", "2023-10-11 11:49:47.467993"], ["supplier_id", 37], ["material_id", 1]]
---
  def create_or_update_purchase_unit_prices

    if params[:purchase_datum][:supplier_id].present? && params[:purchase_datum][:material_id].present? #add230720
      @purchase_unit_prices = PurchaseUnitPrice.where(["supplier_id = ? and material_id = ?",
        params[:purchase_datum][:supplier_id], params[:purchase_datum][:material_id] ]).first
    end
    if @purchase_unit_prices.present?
      #purchase_unit_prices_params = {material_id:  params[:purchase_datum][:material_id], supplier_id: params[:purchase_datum][:supplier_id],
      #                  unit_price: params[:purchase_datum][:purchase_unit_price]}
      #upd180316
      #単位も更新
      purchase_unit_prices_params = {material_id:  params[:purchase_datum][:material_id], supplier_id: params[:purchase_datum][:supplier_id],
                        unit_price: params[:purchase_datum][:purchase_unit_price], unit_id: params[:purchase_datum][:unit_id]}

      @purchase_unit_prices.update(purchase_unit_prices_params)

SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 ORDER BY "supplier_masters"."id" ASC LIMIT $2  [["id", 37], ["LIMIT", 1]]
SELECT "unit_masters".* FROM "unit_masters" WHERE "unit_masters"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def set_construction_and_order_default
  #工事一覧画面等から遷移した場合に、フォームに初期値をセットさせる
	  #.pry

     if params[:purchase_order_id].present?
	   #注文idをセット
	   purchase_order_id = params[:purchase_order_id]
	   @purchase_order_data = PurchaseOrderDatum.where("id >= ?", purchase_order_id)
       tmp_record = PurchaseOrderDatum.where("id = ?", purchase_order_id).first
	   purchase_order_code = tmp_record.purchase_order_code

	   #工事idをセット
	   construction_id = params[:construction_id]

     if construction_id.present?     #add230927
       @construction_data = ConstructionDatum.where("id >= ?", construction_id)
     end

	   #仕入idをセット
	   supplier_master_id = params[:supplier_master_id]
     if supplier_master_id.present?  #add230927
       @supplier_master = SupplierMaster.where("id >= ?", supplier_master_id)

SELECT SUM("construction_daily_reports"."labor_cost") FROM "construction_daily_reports" INNER JOIN "staffs" ON "staffs"."id" = "construction_daily_reports"."staff_id" WHERE "construction_daily_reports"."construction_datum_id" = $1 AND "staffs"."supplier_master_id" = $2  [["construction_datum_id", 1870], ["supplier_master_id", 37]]
---
    #     @construction_datum_id).where(:staff_id => staff_id).sum(:labor_cost)

    #標準版仕様--仕入(外注)先から取得する
    construction_labor_cost = ConstructionDailyReport.where(:construction_datum_id =>
         @construction_datum_id).joins(:Staff).where(staffs: { supplier_master_id: supplier_master_id }).sum(:labor_cost)

SELECT MIN("construction_daily_reports"."working_date") FROM "construction_daily_reports" INNER JOIN "staffs" ON "staffs"."id" = "construction_daily_reports"."staff_id" WHERE "construction_daily_reports"."construction_datum_id" = $1 AND "staffs"."supplier_master_id" = $2  [["construction_datum_id", 1870], ["supplier_master_id", 37]]
SELECT MAX("construction_daily_reports"."working_date") FROM "construction_daily_reports" WHERE "construction_daily_reports"."construction_datum_id" = $1  [["construction_datum_id", 1870]]
---
    #working_start_date = ConstructionDailyReport.where(:construction_datum_id =>
    #     @construction_datum_id).where(:staff_id => staff_id).minimum(:working_date)
    #upd231009
    working_start_date = ConstructionDailyReport.where(:construction_datum_id =>
         @construction_datum_id).joins(:Staff).where(staffs: { supplier_master_id: supplier_master_id }).minimum(:working_date)

    #作業終了日を取得
    #作業完了日は担当(外注)に絞らない
    @working_end_date = ConstructionDailyReport.where(:construction_datum_id =>
         @construction_datum_id).maximum(:working_date)

SELECT "outsourcing_costs".* FROM "outsourcing_costs" WHERE "outsourcing_costs"."purchase_order_datum_id" = $1 AND "outsourcing_costs"."supplier_master_id" = $2 ORDER BY "outsourcing_costs"."id" ASC LIMIT $3  [["purchase_order_datum_id", 2392], ["supplier_master_id", 37], ["LIMIT", 1]]
---
      #outsourcing_cost = OutsourcingCost.where(:purchase_order_datum_id => @purchase_order_datum_id).
      #                     where(:staff_id => staff_id).first

      outsourcing_cost = OutsourcingCost.where(:purchase_order_datum_id => @purchase_order_datum_id).
                           where(:supplier_master_id => supplier_master_id).first

SELECT "outsourcing_costs".* FROM "outsourcing_costs" WHERE "outsourcing_costs"."construction_datum_id" = $1 ORDER BY "outsourcing_costs"."id" ASC LIMIT $2  [["construction_datum_id", 1870], ["LIMIT", 1]]
---
    else
      #outsourcing_cost = OutsourcingCost.where(:construction_datum_id => @construction_datum_id).
      #                     where(:staff_id => staff_id).first
      outsourcing_cost = OutsourcingCost.where(:construction_datum_id => @construction_datum_id).
                           where(:supplier_master_id => supplier_master_id).first

INSERT INTO "outsourcing_costs" ("invoice_code", "purchase_order_datum_id", "construction_datum_id", "supplier_master_id", "working_start_date", "working_end_date", "labor_cost", "billing_amount", "closing_date", "payment_due_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
                            supplier_master_id: supplier_master_id, labor_cost: construction_labor_cost, billing_amount: billing_amount, closing_date: @closing_date,
                            payment_due_date: @payment_due_date, working_start_date: working_start_date, working_end_date: @working_end_date}

      outsourcing_cost = OutsourcingCost.create(outsourcing_params)

UPDATE "purchase_data" SET "material_name" = $1, "closing_date" = $2, "updated_at" = $3 WHERE "purchase_data"."id" = $4  [["material_name", "＜手入力用＞"], ["closing_date", "2020-10-31"], ["updated_at", "2023-10-11 11:49:47.599001"], ["id", 18136]]
---
  def set_ajax_outsourcing_default_data

    @ajax_flag = true

    outsourcing_invoice_flag = params[:flag]
    purchase_params = {outsourcing_invoice_flag: outsourcing_invoice_flag}

    #請求フラグをアップデートしておく
    purchase_data = PurchaseDatum.find(params[:id])
    if purchase_data.present?
      #ヴァリデーションしない
      purchase_data.assign_attributes(purchase_params)
      purchase_data.save!(:validate => false)

SELECT "outsourcing_costs".* FROM "outsourcing_costs" WHERE "outsourcing_costs"."invoice_code" = $1 ORDER BY "outsourcing_costs"."id" ASC LIMIT $2  [["invoice_code", "2020102201"], ["LIMIT", 1]]
SELECT "outsourcing_costs".* FROM "outsourcing_costs" WHERE "outsourcing_costs"."construction_datum_id" = $1 ORDER BY "outsourcing_costs"."id" ASC LIMIT $2  [["construction_datum_id", 1870], ["LIMIT", 1]]
---
  def set_invoice_code

    if @working_end_date.nil?
      search_date = @purchase_date
      return search_date
    end

    purchaseDate = @working_end_date.strftime("%Y%m%d")
    search_date = nil
    search_date_update = nil

    #作業日<>完了日
    differDate = false
    if @purchase_date != @working_end_date
      differDate = true
    end

    for i in 1..99 do
      num = "%02d" % i
      search_date = purchaseDate + num
      outsourcing_cost = OutsourcingCost.where(:invoice_code => search_date).first

      if outsourcing_cost.nil?

        #190930 未使用？？？
        #状況によっては、請求ナンバーを空きコードでアプデしないようにする
        if params[:action] == "update"  #アプデなら、空きコードでアップしない
          outsourcing_cost_a = OutsourcingCost.where(:construction_datum_id => params[:purchase_datum][:construction_datum_id]).first

SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2  [["id", 86], ["LIMIT", 1]]
---
  def get_customer_date_info

    require "date"

    #construction = ConstructionDatum.find(@construction_datum_id)
    #upd230720
    construction = ConstructionDatum.where(id: @construction_datum_id).first

    customer = nil
    if construction.present?
      customer = CustomerMaster.find(construction.customer_id)

SELECT "material_masters".* FROM "material_masters"
SELECT "unit_masters".* FROM "unit_masters"
---
    def set_material
      #ここで資材マスターもセットしておく(動作軽減のため)
      #@@material_masters = MaterialMaster.all
      @material_masters = MaterialMaster.all