app/controllers/purchase_divisions_controller.rb

SELECT "purchase_divisions".* FROM "purchase_divisions" WHERE "purchase_divisions"."id" = $1 LIMIT $2
---
    def set_purchase_division
      @purchase_division = PurchaseDivision.find(params[:id])