app/controllers/purchase_order_data_controller.rb

  def set_responsible

    @supplier_update_flag = 0  # 1:new  2:upd

    #画面のメアドをグローバルへセット
    #仕入先担当Ｍから選択できるようにした
    #$email_responsible = nil
    #$responsible_name = nil
    @email_responsible = nil
    @responsible_name = nil

    if params[:purchase_order_datum][:supplier_responsible_id].present?
      supplier_responsible = SupplierResponsible.where(id: params[:purchase_order_datum][:supplier_responsible_id]).first
---
SELECT "supplier_responsibles".* FROM "supplier_responsibles" WHERE "supplier_responsibles"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

    #$email_responsible2 = nil
    @email_responsible2 = nil
    if params[:purchase_order_datum][:supplier_master_id].present?
      supplier = SupplierMaster.where(id: params[:purchase_order_datum][:supplier_master_id]).first

      if supplier.present? && supplier.email_cc.present?
---
SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "supplier_masters".* FROM "supplier_masters"