app/controllers/purchase_order_histories_controller.rb

  def index2
    #一覧用
    purchase_order_datum_id = params[:purchase_order_datum_id].to_i
    if params[:purchase_order_datum_id].present?
      #$purchase_order_datum_id = purchase_order_datum_id
      @purchase_order_datum_id = purchase_order_datum_id
    end

    #一覧ヘッダ表示用
    @purchase_order_code = params[:purchase_order_code]
    @construction_name = params[:construction_name]
    @supplier_name = params[:supplier_name]

    @orders = Order.joins(:purchase_order_history).where("purchase_order_histories.purchase_order_datum_id = ?", purchase_order_datum_id)
    .where("orders.purchase_order_history_id = purchase_order_histories.id")

    if @orders.present?
      #$orders = @orders

      #upd230508
      session[:purchase_order_datum_id] = purchase_order_datum_id

    else
      if session[:purchase_order_datum_id].present?

        #
        purchase_order_datum_id = session[:purchase_order_datum_id]
        @orders = Order.joins(:purchase_order_history).where("purchase_order_histories.purchase_order_datum_id = ?", purchase_order_datum_id)
        .where("orders.purchase_order_history_id = purchase_order_histories.id")
---
SELECT "orders".* FROM "orders" INNER JOIN "purchase_order_histories" ON "purchase_order_histories"."id" = "orders"."purchase_order_history_id" WHERE (purchase_order_histories.purchase_order_datum_id = 0) AND (orders.purchase_order_history_id = purchase_order_histories.id)
SELECT "orders"."purchase_order_history_id" FROM "orders" INNER JOIN "purchase_order_histories" ON "purchase_order_histories"."id" = "orders"."purchase_order_history_id" WHERE (purchase_order_histories.purchase_order_datum_id = 3897) AND (orders.purchase_order_history_id = purchase_order_histories.id)

        #temp_id = $orders.pluck('purchase_order_history_id').first
        temp_id = @orders.pluck('purchase_order_history_id').first
        if temp_id.present?
          @tmp_purchase_order_history = PurchaseOrderHistory.find(temp_id)
---
SELECT "purchase_order_histories".* FROM "purchase_order_histories" WHERE "purchase_order_histories"."id" = $1 LIMIT $2

        end
        #add170721
        if @purchase_order_data.present?
          @supplier_master = SupplierMaster.find(@purchase_order_data.supplier_master_id)
---
SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2

        #@purchase_order_history = @purchase_order_history_saved

        @purchase_order_data  = PurchaseOrderDatum.find($purchase_order_history.purchase_order_datum_id)
        @supplier_master = SupplierMaster.find($purchase_order_history.supplier_master_id)
---
SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2

        ##
        #連番を割り振る処理
        @orders = nil
        if @purchase_order_history.orders.present?
---
SELECT "orders".* FROM "orders" WHERE "orders"."purchase_order_history_id" = $1

    def set_email_default

      @supplier_responsibles = nil
      @supplier_responsible_emails = nil

      if @purchase_order_history.purchase_order_datum.supplier_responsible_id.present?

        @supplier_responsibles =
        SupplierResponsible.where(:id => params[:supplier_responsible_id]).pluck("responsible_email, id")
---
SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."id" IS NULL

    def get_data
      #
      $purchase_order_history = PurchaseOrderHistory.find_by(purchase_order_datum_id: params[:purchase_order_datum_id],
      purchase_order_date: params[:purchase_order_date] , supplier_master_id: params[:supplier_master_id])
---
SELECT "purchase_order_histories".* FROM "purchase_order_histories" WHERE "purchase_order_histories"."purchase_order_datum_id" = $1 AND "purchase_order_histories"."purchase_order_date" = $2 AND "purchase_order_histories"."supplier_master_id" = $3 LIMIT $4

  def create

    #binding.pry

    $id = params[:purchase_order_history][:purchase_order_datum_id]

    @purchase_order_history = PurchaseOrderHistory.new(purchase_order_history_params)

    #パラーメータ補完する
    set_params_complement

    @purchase_order_history = PurchaseOrderHistory.new(purchase_order_history_params)

    #メール送信済みフラグをセット
    #set_mail_sent_flag

    #add230922
    #注文書を2回押した場合等、データ2重登録しないようにする
    get_data_on_create_twice

    respond_to do |format|
      #if PurchaseOrderHistory.create(purchase_order_history_params)
      if @purchase_order_history.save!(:validate => false)
---
INSERT INTO "orders" ("purchase_order_history_id", "material_id", "material_code", "material_name", "maker_id", "quantity", "unit_master_id", "list_price", "order_unit_price", "order_price", "material_category_id", "sequential_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def get_data_on_create_twice
    tmp_history = PurchaseOrderHistory.where(purchase_order_date: params[:purchase_order_history][:purchase_order_date],
                                             purchase_order_datum_id: params[:purchase_order_history][:purchase_order_datum_id]).first
---
SELECT "purchase_order_histories".* FROM "purchase_order_histories" WHERE "purchase_order_histories"."purchase_order_date" = $1 AND "purchase_order_histories"."purchase_order_datum_id" = $2 ORDER BY "purchase_order_histories"."id" ASC LIMIT $3

  def update

    #del170724
    #すでに登録していた注文データは一旦抹消する。
    destroy_before_update

    #パラーメータ補完する
    set_params_complement

    #binding.pry

    respond_to do |format|

      #format.html

      #format.any ##???
      format.any { render json: purchase_order_history_params}

      @purchase_order_history.attributes = purchase_order_history_params
      #@quotation_headers.save(:validate => false)
      if @purchase_order_history.save!
---
INSERT INTO "orders" ("purchase_order_history_id", "material_id", "material_code", "material_name", "maker_id", "quantity", "unit_master_id", "list_price", "order_unit_price", "order_price", "material_category_id", "mail_sent_flag", "sequential_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

  def destroy_before_update
    #すでに登録していた注文データは一旦抹消する。
    purchase_order_history_id = @purchase_order_history.id
    Order.where(purchase_order_history_id: purchase_order_history_id).destroy_all
---
DELETE FROM "orders" WHERE "orders"."id" = $1
SELECT "orders".* FROM "orders" WHERE "orders"."purchase_order_history_id" = $1

  def set_params_complement

    i = 0

    #仕入先を画面で変更している場合があるので、その場合に差し替える
    if @purchase_order_history.supplier_master_id != params[:purchase_order_history][:supplier_master_id]
      @purchase_order_history.supplier_master_id = params[:purchase_order_history][:supplier_master_id]

      #注文データの仕入先も更新する
      purchase_order_data = PurchaseOrderDatum.find(@purchase_order_history.purchase_order_datum_id)
      if purchase_order_data.present?
        purchase_order_data_params = {supplier_master_id: params[:purchase_order_history][:supplier_master_id]}
        purchase_order_data.update(purchase_order_data_params)
      end
    end
    #

    if params[:purchase_order_history][:orders_attributes].present?

      params[:purchase_order_history][:orders_attributes].values.each do |item|

        if  item[:quantity].to_i == 0
          item[:quantity] = item[:quantity].tr('0-9a-zA-Z', '0-9a-zA-Z')
        end
        item[:quantity] = item[:quantity].to_i
        @maker_master = MakerMaster.where(:id => item[:maker_id]).first
---
SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2
SELECT "orders".* FROM "orders" WHERE "orders"."purchase_order_history_id" = $1
SELECT "maker_masters".* FROM "maker_masters" WHERE "maker_masters"."id" = $1 ORDER BY "maker_masters"."id" ASC LIMIT $2

        #

        #分類手入力の場合の新規登録
        @material_category = MaterialCategory.where(:id => item[:material_category_id]).first
---
SELECT "material_categories".* FROM "material_categories" WHERE "material_categories"."id" = $1 ORDER BY "material_categories"."id" ASC LIMIT $2


        #手入力以外なら、商品CD・IDをセットする。
        if id != 1 then
          @material_master = MaterialMaster.find(id)
---
SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2

            (item[:unit_master_id] != @material_master.unit_id )

            #品名・メーカーを登録or変更した場合は、商品マスターへ反映させる。
            materials = MaterialMaster.where(:id => @material_master.id).first
            if materials.present?
---
SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 ORDER BY "material_masters"."id" ASC LIMIT $2

            end
          end

          purchase_unit_price = PurchaseUnitPrice.where(["supplier_id = ? and material_id = ?",
          params[:purchase_order_history][:supplier_master_id], item[:material_id] ]).first
---
SELECT "purchase_unit_prices".* FROM "purchase_unit_prices" WHERE (supplier_id = '2' and material_id = '626') ORDER BY "purchase_unit_prices"."supplier_id" ASC, "purchase_unit_prices"."material_id" ASC LIMIT $1

  def update_responsible

    #params[:purchase_order_history][:supplier_master_id]

    supplier_responsible_params = { supplier_master_id: params[:purchase_order_history][:supplier_master_id],
                                    responsible_name: $responsible,
                                    responsible_email: $email_responsible
                                  }

    supplier_responsible_id = 0

    case @supplier_update_flag
    when 1  #新規
      supplier_responsible = SupplierResponsible.new(supplier_responsible_params)
      supplier_responsible.save!(:validate => false)

      #パラメーターへ再び戻す
      #params[:purchase_order_datum][:supplier_responsible_id] = supplier_responsible.id
      supplier_responsible_id = supplier_responsible.id
    when 2  #更新
      supplier_responsible = SupplierResponsible.where(:id => params[:purchase_order_history][:responsible]).first

      if supplier_responsible.present?
        supplier_responsible_id = supplier_responsible.id
        supplier_responsible.update(supplier_responsible_params)
---
UPDATE "orders" SET "updated_at" = $1, "printed_flag" = $2 WHERE "orders"."id" = $3

  def set_purchase_order_history
    @purchase_order_history = PurchaseOrderHistory.find(params[:id])
---
SELECT "purchase_order_histories".* FROM "purchase_order_histories" WHERE "purchase_order_histories"."id" = $1 LIMIT $2