app/controllers/purchase_order_histories_controller.rb

  def index2
    #一覧用
    purchase_order_datum_id = params[:purchase_order_datum_id].to_i
    if params[:purchase_order_datum_id].present?
      #$purchase_order_datum_id = purchase_order_datum_id
      @purchase_order_datum_id = purchase_order_datum_id
    end

    #一覧ヘッダ表示用
    @purchase_order_code = params[:purchase_order_code]
    @construction_name = params[:construction_name]
    @supplier_name = params[:supplier_name]

    @orders = Order.joins(:purchase_order_history).where("purchase_order_histories.purchase_order_datum_id = ?", purchase_order_datum_id)
    .where("orders.purchase_order_history_id = purchase_order_histories.id")

    if @orders.present?
---
SELECT "orders".* FROM "orders" INNER JOIN "purchase_order_histories" ON "purchase_order_histories"."id" = "orders"."purchase_order_history_id" WHERE (purchase_order_histories.purchase_order_datum_id = 3897) AND (orders.purchase_order_history_id = purchase_order_histories.id)

        #temp_id = $orders.pluck('purchase_order_history_id').first
        temp_id = @orders.pluck('purchase_order_history_id').first
        if temp_id.present?
          @tmp_purchase_order_history = PurchaseOrderHistory.find(temp_id)
---
SELECT "purchase_order_histories".* FROM "purchase_order_histories" WHERE "purchase_order_histories"."id" = $1 LIMIT $2  [["id", 1213], ["LIMIT", 1]]


      #
      #ここは直で仕入先ID取るべきかも?
      @supplier_responsible = SupplierResponsible.where(:supplier_master_id =>
      @purchase_order_history.purchase_order_datum.supplier_master.id)
---
SELECT "supplier_responsibles".* FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1  [["supplier_master_id", 2]]

    def get_max_seq

       @details = nil
      if @purchase_order_history.orders.present?

        @details = @purchase_order_history.orders
      end

      if  @details.present?
        if @details.maximum(:sequential_id).present?
---
SELECT MAX("orders"."sequential_id") FROM "orders" WHERE "orders"."purchase_order_history_id" = $1  [["purchase_order_history_id", 1213]]

          @purchase_order_data  = PurchaseOrderDatum.find($id)
        elsif params[:purchase_order_history].present? &&
              params[:purchase_order_history][:purchase_order_datum_id].present?
          @purchase_order_data  = PurchaseOrderDatum.find(params[:purchase_order_history][:purchase_order_datum_id])
---
SELECT "purchase_order_histories".* FROM "purchase_order_histories" WHERE "purchase_order_histories"."id" = $1 LIMIT $2  [["id", 1213], ["LIMIT", 1]]

          @purchase_order_history.supplier_master_id = @purchase_order_data.supplier_master_id
        end
        #リロード用（注文業者をセット）
        if @purchase_order_history.supplier_master_id.blank?   #addd170914
---
SELECT "supplier_masters".* FROM "supplier_masters"
SELECT "unit_masters".* FROM "unit_masters"

        end
        #add170721
        if @purchase_order_data.present?
          @supplier_master = SupplierMaster.find(@purchase_order_data.supplier_master_id)
---
SELECT "unit_masters".* FROM "unit_masters" WHERE "unit_masters"."id" = $1 ORDER BY "unit_masters"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

        @purchase_order_history = $purchase_order_history
        #@purchase_order_history = @purchase_order_history_saved

        @purchase_order_data  = PurchaseOrderDatum.find($purchase_order_history.purchase_order_datum_id)
        @supplier_master = SupplierMaster.find($purchase_order_history.supplier_master_id)
---
SELECT "orders".* FROM "orders" WHERE "orders"."purchase_order_history_id" = $1 ORDER BY sequential_id DESC  [["purchase_order_history_id", 1213]]
SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

        ##
        #連番を割り振る処理
        @orders = nil
        if @purchase_order_history.orders.present?
---
SELECT "orders".* FROM "orders" WHERE "orders"."purchase_order_history_id" = $1  [["purchase_order_history_id", 1213]]

    def set_email_default

      @supplier_responsibles = nil
      @supplier_responsible_emails = nil

      if @purchase_order_history.purchase_order_datum.supplier_responsible_id.present?

        @supplier_responsibles =
        SupplierResponsible.where(:id => params[:supplier_responsible_id]).pluck("responsible_email, id")
---
SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."id" IS NULL

    def get_data
      #
      $purchase_order_history = PurchaseOrderHistory.find_by(purchase_order_datum_id: params[:purchase_order_datum_id],
      purchase_order_date: params[:purchase_order_date] , supplier_master_id: params[:supplier_master_id])
---
SELECT "purchase_order_histories".* FROM "purchase_order_histories" WHERE "purchase_order_histories"."purchase_order_datum_id" = $1 AND "purchase_order_histories"."purchase_order_date" = $2 AND "purchase_order_histories"."supplier_master_id" = $3 LIMIT $4  [["purchase_order_datum_id", 3897], ["purchase_order_date", "2023-10-07"], ["supplier_master_id", 2], ["LIMIT", 1]]

  def update

    #del170724
    #すでに登録していた注文データは一旦抹消する。
    destroy_before_update

    #パラーメータ補完する
    set_params_complement

    #binding.pry

    respond_to do |format|

      #format.html

      #format.any ##???
      format.any { render json: purchase_order_history_params}

      @purchase_order_history.attributes = purchase_order_history_params
      #@quotation_headers.save(:validate => false)
      if @purchase_order_history.save!
---
INSERT INTO "orders" ("purchase_order_history_id", "material_id", "material_code", "material_name", "maker_id", "quantity", "unit_master_id", "order_unit_price", "order_price", "material_category_id", "sequential_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def destroy_before_update
    #すでに登録していた注文データは一旦抹消する。
    purchase_order_history_id = @purchase_order_history.id
    Order.where(purchase_order_history_id: purchase_order_history_id).destroy_all
---
DELETE FROM "orders" WHERE "orders"."id" = $1  [["id", 347]]
SELECT "orders".* FROM "orders" WHERE "orders"."purchase_order_history_id" = $1  [["purchase_order_history_id", 1213]]

  def set_params_complement

    i = 0

    #仕入先を画面で変更している場合があるので、その場合に差し替える
    if @purchase_order_history.supplier_master_id != params[:purchase_order_history][:supplier_master_id]
      @purchase_order_history.supplier_master_id = params[:purchase_order_history][:supplier_master_id]

      #注文データの仕入先も更新する
      purchase_order_data = PurchaseOrderDatum.find(@purchase_order_history.purchase_order_datum_id)
      if purchase_order_data.present?
        purchase_order_data_params = {supplier_master_id: params[:purchase_order_history][:supplier_master_id]}
        purchase_order_data.update(purchase_order_data_params)
      end
    end
    #

    if params[:purchase_order_history][:orders_attributes].present?

      params[:purchase_order_history][:orders_attributes].values.each do |item|

        if  item[:quantity].to_i == 0
          item[:quantity] = item[:quantity].tr('0-9a-zA-Z', '0-9a-zA-Z')
        end
        item[:quantity] = item[:quantity].to_i
        @maker_master = MakerMaster.where(:id => item[:maker_id]).first
---
SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "maker_masters".* FROM "maker_masters" WHERE "maker_masters"."id" = $1 ORDER BY "maker_masters"."id" ASC LIMIT $2  [["id", 26], ["LIMIT", 1]]

        #

        #分類手入力の場合の新規登録
        @material_category = MaterialCategory.where(:id => item[:material_category_id]).first
---
SELECT "material_categories".* FROM "material_categories" WHERE "material_categories"."id" = $1 ORDER BY "material_categories"."id" ASC LIMIT $2  [["id", 123], ["LIMIT", 1]]


            @material_category = MaterialCategory.where(:name => item[:material_category_id]).first

            if @material_category.blank?
---
SELECT "material_categories".* FROM "material_categories"


        #手入力以外なら、商品CD・IDをセットする。
        if id != 1 then
          @material_master = MaterialMaster.find(id)
---
SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 ORDER BY "material_masters"."id" ASC LIMIT $2  [["id", 4630], ["LIMIT", 1]]


            #品名・メーカーを登録or変更した場合は、商品マスターへ反映させる。
            materials = MaterialMaster.where(:id => @material_master.id).first
            if materials.present?
---
SELECT "material_masters".* FROM "material_masters"

            end
          end

          purchase_unit_price = PurchaseUnitPrice.where(["supplier_id = ? and material_id = ?",
          params[:purchase_order_history][:supplier_master_id], item[:material_id] ]).first
---
SELECT "purchase_unit_prices".* FROM "purchase_unit_prices" WHERE (supplier_id = '2' and material_id = '4630') ORDER BY "purchase_unit_prices"."supplier_id" ASC, "purchase_unit_prices"."material_id" ASC LIMIT $1  [["LIMIT", 1]]


              #仕入先単価マスターへも登録。
              @material_master = MaterialMaster.find_by(material_code: item[:material_code])
              if @material_master.present?
---
SELECT 1 AS one FROM "material_masters" WHERE "material_masters"."material_code" = $1 AND "material_masters"."id" != $2 LIMIT $3  [["material_code", "OL291024R"], ["id", 4630], ["LIMIT", 1]]

  def set_masters
    @material_masters = MaterialMaster.all
    @unit_masters = UnitMaster.all
    @maker_masters = MakerMaster.all
---
SELECT "maker_masters".* FROM "maker_masters"