app/controllers/purchase_data_controller.rb

  def unit_select
    @unit_masters  = PurchaseUnitPrice.with_unit.where(:supplier_id => params[:supplier_id], :material_id => params[:material_id]).where("supplier_id is NOT NULL").where("material_id is NOT NULL").pluck("unit_masters.unit_name, unit_masters.id")
---
SELECT "purchase_unit_prices"."unit_price" FROM "purchase_unit_prices" WHERE "purchase_unit_prices"."supplier_id" = $1 AND "purchase_unit_prices"."material_id" = $2 AND (supplier_id is NOT NULL) AND (material_id is NOT NULL)

  def construction_select_on_stocked
    #@construction_datum_id = 1  #デフォルト

    material_master = MaterialMaster.find(params[:material_id])
    if material_master.present?

      if material_master.inventory_category_id.present?
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."material_master_id" = $1 ORDER BY "inventories"."id" ASC LIMIT $2