app/controllers/purchase_order_data_controller.rb

SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1 AND "supplier_responsibles"."id" != $2
---
  def get_email1
     @email1 = SupplierMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:email1).flatten.join(" ")

     #supplier_responsibleから取得する
     @supplier_responsibles = SupplierResponsible.where(:supplier_master_id => params[:id]).pluck("responsible_name, id")
     @supplier_responsible_emails = SupplierResponsible.where(:supplier_master_id => params[:id]).pluck("responsible_email, id")

SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."id" = $1
---
  def get_responsible_email
    @supplier_responsible_emails = SupplierResponsible.where(:id => params[:supplier_responsible_id]).pluck("responsible_email, id")