app/controllers/purchase_order_histories_controller.rb

  def set_params_complement

    i = 0

    #仕入先を画面で変更している場合があるので、その場合に差し替える
    if @purchase_order_history.supplier_master_id != params[:purchase_order_history][:supplier_master_id]
      @purchase_order_history.supplier_master_id = params[:purchase_order_history][:supplier_master_id]

      #注文データの仕入先も更新する
      purchase_order_data = PurchaseOrderDatum.find(@purchase_order_history.purchase_order_datum_id)
---
SELECT "orders".* FROM "orders" WHERE "orders"."purchase_order_history_id" = $1  [["purchase_order_history_id", 1213]]
SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]


              #仕入先単価マスターへも登録。
              @material_master = MaterialMaster.find_by(material_code: item[:material_code])
              if @material_master.present?
---
SELECT 1 AS one FROM "material_masters" WHERE "material_masters"."material_code" = $1 AND "material_masters"."id" != $2 LIMIT $3  [["material_code", "OL291024R"], ["id", 4630], ["LIMIT", 1]]

  def set_purchase_order(format)

    #$attachment = nil
    @attachment = nil

    if params[:format] == "pdf"

      #注文書の発行
      save_only_flag = false
      #global set
      $purchase_order_history = @purchase_order_history

      $mail_flag = 0

      #送信済み・削除判定が必要なので現在のパラメータをセット
      $order_parameters = params[:purchase_order_history][:orders_attributes]

      #if $order_parameters.present?  #add230719

      #ログイン中のUser確認(Standard)
      #add230831
      app_get_session_user

      if params[:purchase_order_history][:sent_flag] != "1"
        format.pdf do
          #report = PurchaseOrderPDF.create @purchase_order
          report = PurchaseOrderPDF.create(@purchase_order, @company_id)
---
INSERT INTO "orders" ("purchase_order_history_id", "material_id", "material_code", "material_name", "maker_id", "quantity", "unit_master_id", "order_unit_price", "order_price", "material_category_id", "mail_sent_flag", "sequential_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"