app/controllers/purchase_order_data_controller.rb

    if params[:purchase_order_datum][:supplier_master_id].present?
      supplier = SupplierMaster.where(id: params[:purchase_order_datum][:supplier_master_id]).first

      if supplier.present? && supplier.email_cc.present?
---
SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 ORDER BY "supplier_masters"."id" ASC LIMIT $2

  def update_constant
    #constant = Constant.find(1)   #id=１に定数ファイルが保管されている
    #共通版対応
    constant = Constant.where(:id => 1).first
    if constant.blank?
---
SELECT "constants".* FROM "constants" WHERE "constants"."id" = $1 ORDER BY "constants"."id" ASC LIMIT $2