app/controllers/purchase_data_controller.rb

    #@purchase_data = @q.result
    result = @q.result

    @purchase_data = result.includes([:MaterialMaster, :construction_datum, :unit_master, :SupplierMaster,
          :purchase_header, :purchase_order_datum, :PurchaseDivision, MaterialMaster: :material_category,
          construction_datum: :CustomerMaster])
---
SELECT DISTINCT "supplier_masters".* FROM "supplier_masters" INNER JOIN "purchase_data" ON "purchase_data"."supplier_id" = "supplier_masters"."id" WHERE (purchase_data.construction_datum_id = '2712')