app/controllers/purchase_order_histories_controller.rb

        #@purchase_order_history = @purchase_order_history_saved

        @purchase_order_data  = PurchaseOrderDatum.find($purchase_order_history.purchase_order_datum_id)
        @supplier_master = SupplierMaster.find($purchase_order_history.supplier_master_id)
---
SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2

    def set_email_default

      @supplier_responsibles = nil
      @supplier_responsible_emails = nil

      if @purchase_order_history.purchase_order_datum.supplier_responsible_id.present?

        @supplier_responsibles =
        SupplierResponsible.where(:id => params[:supplier_responsible_id]).pluck("responsible_email, id")
---
SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."id" IS NULL

    def get_data
      #
      $purchase_order_history = PurchaseOrderHistory.find_by(purchase_order_datum_id: params[:purchase_order_datum_id],
      purchase_order_date: params[:purchase_order_date] , supplier_master_id: params[:supplier_master_id])
---
SELECT "purchase_order_histories".* FROM "purchase_order_histories" WHERE "purchase_order_histories"."purchase_order_datum_id" = $1 AND "purchase_order_histories"."purchase_order_date" = $2 AND "purchase_order_histories"."supplier_master_id" = $3 LIMIT $4

  def set_params_complement

    i = 0

    #仕入先を画面で変更している場合があるので、その場合に差し替える
    if @purchase_order_history.supplier_master_id != params[:purchase_order_history][:supplier_master_id]
      @purchase_order_history.supplier_master_id = params[:purchase_order_history][:supplier_master_id]

      #注文データの仕入先も更新する
      purchase_order_data = PurchaseOrderDatum.find(@purchase_order_history.purchase_order_datum_id)
      if purchase_order_data.present?
---
SELECT "orders".* FROM "orders" WHERE "orders"."purchase_order_history_id" = $1

        $mail_flag = 1
        #PDFを作成
        #report = PurchaseOrderPDF.create @purchase_order
        report = PurchaseOrderPDF.create(@purchase_order, @company_id)
---
INSERT INTO "orders" ("purchase_order_history_id", "material_id", "material_code", "material_name", "maker_id", "quantity", "unit_master_id", "list_price", "order_unit_price", "order_price", "material_category_id", "mail_sent_flag", "sequential_id", "created_at", "updated_at", "printed_flag") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"

  def material_extract_by_category


    if !(params[:material_category_id].blank?)

      #まず手入力用IDをセット。
      @material_extract_category = MaterialMaster.where(:id => 1).where("id is NOT NULL").
      pluck("CONCAT(material_masters.material_code, ':' , material_masters.material_name), material_masters.id")
      #次に抽出されたアイテムをセット
      @material_extract_category += MaterialMaster.where(:material_category_id => params[:material_category_id]).where("id is NOT NULL").
      pluck("CONCAT(material_masters.material_code, ':' , material_masters.material_name), material_masters.id")

      #商品コードも同様
      @material_extract_category_code = MaterialMaster.where(:id => 1).where("id is NOT NULL").
      pluck("material_masters.material_code, material_masters.material_code")
      @material_extract_category_code += MaterialMaster.where(:material_category_id => params[:material_category_id]).where("id is NOT NULL").
      pluck("material_masters.material_code, material_masters.material_code")
---
SELECT "material_masters"."material_name" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)
SELECT "material_masters"."material_category_id" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)