app/controllers/purchase_order_data_controller.rb

  def get_responsible_email
    @supplier_responsible_emails = SupplierResponsible.where(:id => params[:supplier_responsible_id]).pluck("responsible_email, id")

    #仕入の担当者も全て加える
    @supplier_responsible_emails += SupplierResponsible.where(:supplier_master_id => params[:supplier_master_id]).
                                               where.not(:id => params[:supplier_responsible_id]).pluck("responsible_email, id")
---
SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."id" = $1
SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1 AND "supplier_responsibles"."id" != $2