app/controllers/quotation_detail_middle_classifications_controller.rb

SELECT "quotation_headers".* FROM "quotation_headers" WHERE "quotation_headers"."id" = $1 LIMIT $2
---
  def edit

    @working_middle_item = WorkingMiddleItem.all
    @working_category = WorkingCategory.all

    #カテゴリー保持フラグを取得
    get_category_save_flag

    #確定済みのものは、変更できないようにする
    if params[:quotation_header_id].present?
      quotation_header = QuotationHeader.find(params[:quotation_header_id])
      if quotation_header.present?

SELECT "quotation_detail_middle_classifications".* FROM "quotation_detail_middle_classifications" WHERE "quotation_detail_middle_classifications"."id" = $1 LIMIT $2
---
    def set_quotation_detail_middle_classification
      @quotation_detail_middle_classification = QuotationDetailMiddleClassification.find(params[:id])

SELECT "quotation_headers".* FROM "quotation_headers" WHERE "quotation_headers"."id" = $1 LIMIT $2
---
    def get_category_save_flag
      if @quotation_detail_middle_classification.quotation_header_id.present?

        if @quotation_header.nil?
          @quotation_header = QuotationHeader.find_by(id: @quotation_detail_middle_classification.quotation_header_id)
        end

        if @quotation_header.present?

SELECT "working_middle_items".* FROM "working_middle_items" WHERE "working_middle_items"."id" = $1
SELECT "working_middle_items".* FROM "working_middle_items" WHERE "working_middle_items"."working_middle_item_category_id" = $1 ORDER BY "working_middle_items"."seq" ASC
---
    def extract_middle_item
      if @quotation_detail_middle_classification.working_middle_item_category_id_call.present?
        @working_middle_item = WorkingMiddleItem.where(:id => "1")
        @working_middle_item += WorkingMiddleItem.where(:working_middle_item_category_id =>
                          @quotation_detail_middle_classification.working_middle_item_category_id_call).order(:seq)