app/controllers/quotation_detail_large_classifications_controller.rb

SELECT "customer_masters".* FROM "customer_masters" WHERE "customer_masters"."id" = $1 LIMIT $2
SELECT "quotation_headers".* FROM "quotation_headers" WHERE "quotation_headers"."id" = $1 ORDER BY "quotation_headers"."id" ASC LIMIT $2
---
  def get_public_flag

    $public_flag = false

    #quotation_header = QuotationHeader.find(params[:quotation_header_id])
    #upd230720
    quotation_header = QuotationHeader.where(id: params[:quotation_header_id]).first

    #if quotation_header.customer_master.present?
    #upd230720
    if quotation_header.present? && quotation_header.customer_master.present?

SELECT "quotation_headers".* FROM "quotation_headers" WHERE "quotation_headers"."id" = $1 LIMIT $2
---
  def edit
    #カテゴリー保持フラグを取得
    get_category_save_flag

    #確定済みのものは、変更できないようにする
    if params[:quotation_header_id].present?
      quotation_header = QuotationHeader.find(params[:quotation_header_id])
      if quotation_header.present?

UPDATE "quotation_detail_large_classifications" SET "execution_price" = $1, "updated_at" = $2 WHERE "quotation_detail_large_classifications"."id" = $3
---
  def update

      #作業明細マスターの更新
    update_working_middle_item

    #@quotation_detail_large_classification.update(quotation_detail_large_classification_params)
    #respond_to do |format|  #バリデーションで今後使えるかもしれないので残しておく！

    if @quotation_detail_large_classification.update(quotation_detail_large_classification_params)

SELECT "quotation_detail_large_classifications".* FROM "quotation_detail_large_classifications" WHERE (quotation_header_id = '8')
SELECT "quotation_detail_large_classifications".* FROM "quotation_detail_large_classifications" WHERE (quotation_header_id = '8') ORDER BY "quotation_detail_large_classifications"."line_number" ASC
---
  def recalc_subtotal
  #小計を再計算する
    @search_records = QuotationDetailLargeClassification.where("quotation_header_id = ?", params[:quotation_detail_large_classification][:quotation_header_id])

    if @search_records.present?
      start_line_number = 0
      end_line_number = 0

      current_line_number = params[:quotation_detail_large_classification][:line_number].to_i

      subtotal_exist = false
      id_saved = 0

      @search_records.order(:line_number).each do |qdlc|

SELECT working_units.working_unit_name, working_units.id FROM "working_units"
---
  def working_unit_id_select
    @working_unit_id  = WorkingMiddleItem.with_unit.where(:id => params[:id]).pluck("working_units.working_unit_name, working_units.id")
    #登録済み単位と異なるケースもあるので、任意で変更もできるように全ての単位をセット
    unit_all = WorkingUnit.all.pluck("working_units.working_unit_name, working_units.id")

SELECT working_units.working_unit_name, working_units.id FROM "working_middle_items" INNER JOIN "working_units" ON "working_units"."id" = "working_middle_items"."working_unit_id" WHERE "working_middle_items"."id" = $1
---
  def execution_unit_price_select
    @execution_unit_price = WorkingMiddleItem.where(:id => params[:id]).where("id is NOT NULL").pluck(:execution_unit_price).flatten.join(" ")

SELECT "working_middle_items"."labor_productivity_unit" FROM "working_middle_items" WHERE "working_middle_items"."id" = $1 AND (id is NOT NULL)
---
  def labor_productivity_unit_total_select
    @labor_productivity_unit_total = WorkingMiddleItem.where(:id => params[:id]).where("id is NOT NULL").pluck(:labor_productivity_unit_total).flatten.join(" ")

SELECT "quotation_detail_large_classifications".* FROM "quotation_detail_large_classifications" WHERE "quotation_detail_large_classifications"."quotation_header_id" = $1 AND "quotation_detail_large_classifications"."construction_type" = $2 ORDER BY "quotation_detail_large_classifications"."id" ASC LIMIT $3
---
  def update_labor_productivity_unit_summary
    quotation_header_id = params[:quotation_detail_large_classification][:quotation_header_id]

    #配管配線の計を更新(construction_type=constant)
    @QDLC_piping_wiring = QuotationDetailLargeClassification.where(quotation_header_id: quotation_header_id, construction_type: $INDEX_PIPING_WIRING_CONSTRUCTION).first
    if @QDLC_piping_wiring.present?
      labor_productivity_unit_total = QuotationDetailLargeClassification.sum_LPUT_PipingWiring(quotation_header_id)
      @QDLC_piping_wiring.update_attributes!(:labor_productivity_unit_total => labor_productivity_unit_total)
    end

    #機器取付の計を更新(construction_type=)
    @QDLC_equipment_mounting = QuotationDetailLargeClassification.where(quotation_header_id: quotation_header_id, construction_type: $INDEX_EUIPMENT_MOUNTING).first

SELECT "quotation_detail_large_classifications".* FROM "quotation_detail_large_classifications" WHERE "quotation_detail_large_classifications"."id" = $1 LIMIT $2
---
    def set_quotation_detail_large_classification
      @quotation_detail_large_classification = QuotationDetailLargeClassification.find(params[:id])

SELECT "quotation_headers".* FROM "quotation_headers" WHERE "quotation_headers"."id" = $1 LIMIT $2
---
    def save_price_to_headers
      @quotation_header = QuotationHeader.find(@quotation_detail_large_classification.quotation_header_id)

SELECT "quotation_headers".* FROM "quotation_headers" WHERE "quotation_headers"."id" = $1 LIMIT $2
---
    def quotation_headers_set_last_line_number
      @quotation_headers = QuotationHeader.find_by(id: @quotation_detail_large_classification.quotation_header_id)
      check_flag = false
      if @quotation_headers.last_line_number.nil?
        check_flag = true
      else
        if (@quotation_headers.last_line_number < @max_line_number) then
          check_flag = true
        end
      end
      if (check_flag == true)
        quotation_header_params = { last_line_number:  @max_line_number}
        if @quotation_headers.present?

SELECT "quotation_headers".* FROM "quotation_headers" WHERE "quotation_headers"."id" = $1 LIMIT $2
---
    def get_category_save_flag
      if @quotation_detail_large_classification.quotation_header_id.present?
        @quotation_headers = QuotationHeader.find_by(id: @quotation_detail_large_classification.quotation_header_id)
        if @quotation_headers.present?