app/controllers/quotation_material_headers_controller.rb

SELECT "constants"."purchase_order_last_header_code" FROM "constants" WHERE "constants"."id" = $1 AND (id is NOT NULL)
---
  def edit
    #画面の並びは昇順にする
    #新規は昇順、編集は降順。
    @form_detail_order = "sequential_id DESC"

    $new_flag = 0

    #レコード毎のメール送信済みフラグを初期化するためのフラグをセット(一時用)
    reset_mail_sent_flag

    #binding.pry

    #連番の最大値を取る(フォーム用)
    get_max_seq

    #注文NOの頭文字を定数ファイルから取得する
    @last_header_number = Constant.where(:id => 1).
           where("id is NOT NULL").pluck(:purchase_order_last_header_code).flatten.join(" ")

SELECT "quotation_material_details".* FROM "quotation_material_details" WHERE "quotation_material_details"."quotation_material_header_id" = $1
SELECT MAX("quotation_material_details"."sequential_id") FROM "quotation_material_details" WHERE "quotation_material_details"."quotation_material_header_id" = $1
---
  def get_max_seq

    @details = nil
    if @quotation_material_header.quotation_material_details.present?
      @details = @quotation_material_header.quotation_material_details
    end

    if @form_detail_order != "sequential_id DESC"
    #編集時（昇順）はのぞく
      if  @details.present?
        if @details.maximum(:sequential_id).present?
          $seq_exists = @details.maximum(:sequential_id)
          $seq_max = $seq_exists
        end
        #SEQが逆になっているのでみやすいよう再び逆にする
        #reverse_seq
      end
    else
    #昇順の場合
      $seq_exists = 1
      if @details.present?
        $seq_max = @details.maximum(:sequential_id)

SELECT "material_masters"."list_price" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)
SELECT "material_masters"."maker_id" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)
---
  def material_select
    @material_code = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:material_code).flatten.join(" ")
    @material_name = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:material_name).flatten.join(" ")
    @list_price = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:list_price).flatten.join(" ")
    @maker_id = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:maker_id).flatten.join(" ")

    #単位はまず商品マスターから取得する(ここは見積・注文時のみ更新)、なければ仕入単価Mより取得
    @unit_id = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:unit_id).flatten.join(" ")

    if @unit_id.blank?  #ここは基本的に起こり得ない
 	    @unit_id = PurchaseUnitPrice.where(["supplier_id = ? and material_id = ?",
                 params[:supplier_master_id], params[:id] ]).pluck(:unit_id).flatten.join(" ")
    end

    #どちらも該当なければひとまず”個”にする
    if @unit_id.blank?
      @unit_id = "3"
    end

    @notes = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:notes).flatten.join(" ")

    @material_category_id = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:material_category_id).flatten.join(" ")

SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 LIMIT $2
---
              #マスター情報変更した場合は、商品マスターへ反映させる。

            materials = MaterialMaster.where(:id => @material_master.id).first
            if materials.present?

SELECT 1 AS one FROM "material_masters" WHERE "material_masters"."material_code" = $1 AND "material_masters"."id" != $2 LIMIT $3
---

              #仕入先単価マスターへも登録。
              @material_master = MaterialMaster.find_by(material_code: item[:material_code])
              if @material_master.present?

SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."id" = $1
SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1 AND "supplier_responsibles"."id" != $2
SELECT responsible_name, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."id" = $1
---
      if supplier_responsible_id.present? && supplier_responsible_id > 0

        #
        @supplier_responsibles = SupplierResponsible.where(:id => supplier_responsible_id).
               pluck("responsible_name, id")

        @supplier_responsibles += SupplierResponsible.where(:supplier_master_id => params[:supplier_id]).
                                               where.not(:id => supplier_responsible_id).
                                            pluck("responsible_name, id")
        #
        #email
        @supplier_responsible_emails = SupplierResponsible.where(:id => supplier_responsible_id).
               pluck("responsible_email, id")

SELECT responsible_name, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1 AND "supplier_responsibles"."id" != $2
---
      #該当なし => all
        @supplier_responsibles = SupplierResponsible.where(:supplier_master_id => params[:supplier_id]).
                                               pluck("responsible_name, id")
        @supplier_responsible_emails = SupplierResponsible.where(:supplier_master_id => params[:supplier_id]).
                                               pluck("responsible_email, id")