app/controllers/quotation_material_headers_controller.rb

  def material_select
    @material_code = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:material_code).flatten.join(" ")
    @material_name = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:material_name).flatten.join(" ")
    @list_price = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:list_price).flatten.join(" ")
    @maker_id = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:maker_id).flatten.join(" ")

    #単位はまず商品マスターから取得する(ここは見積・注文時のみ更新)、なければ仕入単価Mより取得
    @unit_id = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:unit_id).flatten.join(" ")

    if @unit_id.blank?  #ここは基本的に起こり得ない
 	    @unit_id = PurchaseUnitPrice.where(["supplier_id = ? and material_id = ?",
                 params[:supplier_master_id], params[:id] ]).pluck(:unit_id).flatten.join(" ")
    end

    #どちらも該当なければひとまず”個”にする
    if @unit_id.blank?
      @unit_id = "3"
    end

    @notes = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:notes).flatten.join(" ")

    @material_category_id = MaterialMaster.where(:id => params[:id]).where("id is NOT NULL").pluck(:material_category_id).flatten.join(" ")
---
SELECT "material_masters"."material_category_id" FROM "material_masters" WHERE "material_masters"."id" = $1 AND (id is NOT NULL)

  def update

    if @quotation_material_header.quotation_code == params[:quotation_material_header][:quotation_code]

      #備考１〜３のいずれかへセット
      set_notes_before_save

      #仕入先未登録の場合にセット
      set_supplier_before_save

      #すでに登録していた注文データは一旦抹消する。
	    destroy_before_update

      #パラーメータ補完＆メール送信する
      set_params_complement

      respond_to do |format|

        if @quotation_material_header.update(quotation_material_header_params)
---
UPDATE "quotation_material_headers" SET "notes_1" = $1, "updated_at" = $2 WHERE "quotation_material_headers"."id" = $3

  def destroy_before_update

    #すでに登録していた注文データは一旦抹消する。
    quotation_material_header_id = @quotation_material_header.id
    QuotationMaterialDetail.where(quotation_material_header_id: quotation_material_header_id).destroy_all
---
DELETE FROM "quotation_material_details" WHERE "quotation_material_details"."id" = $1
SELECT "quotation_material_details".* FROM "quotation_material_details" WHERE "quotation_material_details"."quotation_material_header_id" = $1

          item[:quantity] = item[:quantity].tr('０-９ａ-ｚＡ-Ｚ', '0-9a-zA-Z')
        end

        @maker_master = MakerMaster.where(:id => item[:maker_id]).first
---
SELECT "maker_masters".* FROM "maker_masters" WHERE "maker_masters"."id" = $1 ORDER BY "maker_masters"."id" ASC LIMIT $2

        end

        #分類手入力の場合の新規登録
        @material_category = MaterialCategory.where(:id => item[:material_category_id]).first
---
SELECT "material_categories".* FROM "material_categories" WHERE "material_categories"."id" = $1 ORDER BY "material_categories"."id" ASC LIMIT $2

              #↑フィールド追加時注意！
              #マスター情報変更した場合は、商品マスターへ反映させる。

            materials = MaterialMaster.where(:id => @material_master.id).first
---
SELECT "material_masters".* FROM "material_masters" WHERE "material_masters"."id" = $1 ORDER BY "material_masters"."id" ASC LIMIT $2


          #仕入単価マスターも更新する
          if params[:quotation_material_header][:supplier_master_id] != "1"   #手入力仕入先以外
            purchase_unit_price = PurchaseUnitPrice.where(["supplier_id = ? and material_id = ?",
                   params[:quotation_material_header][:supplier_master_id], item[:material_id] ]).first
---
SELECT "purchase_unit_prices".* FROM "purchase_unit_prices" WHERE (supplier_id = '2' and material_id = '934') ORDER BY "purchase_unit_prices"."supplier_id" ASC, "purchase_unit_prices"."material_id" ASC LIMIT $1

    #$email_responsible2 = nil
    @email_responsible2 = nil
    if params[:quotation_material_header][:supplier_master_id].present?
      supplier = SupplierMaster.where(id: params[:quotation_material_header][:supplier_master_id]).first
---
SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 ORDER BY "supplier_masters"."id" ASC LIMIT $2

    #CC、2人目追加
    @email_responsible3 = nil
    if params[:quotation_material_header][:supplier_master_id].present?
      supplier_responsible = SupplierResponsible.where(supplier_master_id: params[:quotation_material_header][:supplier_master_id]).second
---
SELECT "supplier_responsibles".* FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1 ORDER BY "supplier_responsibles"."id" ASC LIMIT $2 OFFSET $3

  def email_select

    @email = SupplierMaster.where(:id => params[:supplier_id]).where("id is NOT NULL").pluck(:email1).flatten.join(" ")
	  @responsible = SupplierMaster.where(:id => params[:supplier_id]).where("id is NOT NULL").pluck(:responsible1).flatten.join(" ")

    purchase_order_data = PurchaseOrderDatum.where(:supplier_master_id => params[:supplier_id]).
                               where(:construction_datum_id => params[:construction_id]).first

    if purchase_order_data.present?

      #
      @supplier_responsibles = SupplierResponsible.where(:id => purchase_order_data.supplier_responsible_id).
               pluck("responsible_name, id")

      @supplier_responsibles += SupplierResponsible.where(:supplier_master_id => params[:supplier_id]).
                                               where.not(:id => purchase_order_data.supplier_responsible_id).
                                            pluck("responsible_name, id")
      #
      #email
      @supplier_responsible_emails = SupplierResponsible.where(:id => purchase_order_data.supplier_responsible_id).
               pluck("responsible_email, id")

      @supplier_responsible_emails += SupplierResponsible.where(:supplier_master_id => params[:supplier_id]).
                                               where.not(:id => purchase_order_data.supplier_responsible_id).
                                            pluck("responsible_email, id")
      #
    else

      #見積データ存在する場合
      quotation_material_header = QuotationMaterialHeader.where(:id => params[:id]).first
---
SELECT "supplier_masters"."email1" FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 AND (id is NOT NULL)
SELECT "supplier_masters"."responsible1" FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 AND (id is NOT NULL)
SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."id" = $1
SELECT responsible_email, id FROM "supplier_responsibles" WHERE "supplier_responsibles"."supplier_master_id" = $1 AND "supplier_responsibles"."id" != $2
SELECT "quotation_material_headers".* FROM "quotation_material_headers" WHERE "quotation_material_headers"."id" = $1 ORDER BY "quotation_material_headers"."id" ASC LIMIT $2

    #

    #quotation_material_header = QuotationMaterialHeader.where(params[:id]).first
    quotation_material_header = QuotationMaterialHeader.where(:id => params[:id]).first
---
SELECT "quotation_material_headers".* FROM "quotation_material_headers" WHERE "quotation_material_headers"."id" = $1 ORDER BY "quotation_material_headers"."id" ASC LIMIT $2