app/controllers/quotation_material_headers_controller.rb

            #                               @supplier, request_type, purchase_order_code, mail_flag, @company_id, session[:user_id])

            #upd241126
            report = PurchaseOrderAndEstimatePDF.create(@quotation_material_header, @quotation_material_header.quotation_material_details,
                                           @supplier, request_type, purchase_order_code, mail_flag, @company_id, session[:user_id])
---
INSERT INTO "quotation_material_details" ("quotation_material_header_id", "material_id", "material_code", "material_name", "maker_id", "maker_name", "quantity", "unit_master_id", "list_price", "bid_flag_1", "bid_flag_2", "bid_flag_3", "quotation_email_flag_1", "quotation_email_flag_2", "quotation_email_flag_3", "order_email_flag_1", "order_email_flag_2", "order_email_flag_3", "sequential_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"