app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "adusu"], ["LIMIT", 1]]
---
  def create
    #user = User.find_by(email: params[:session][:email].downcase)

    user = User.find_by(name: params[:session][:name])