app/controllers/staffs_controller.rb

SELECT "staffs".* FROM "staffs" WHERE "staffs"."id" = $1 LIMIT $2
---
    def set_staff
      @staff = Staff.find(params[:id])