app/controllers/stocktakes_controller.rb

  def update

    #在庫マスターのIDをセットする
    @update_flag = 1
	set_inventories_id

    respond_to do |format|
      if @stocktake.update(stocktake_params)
---
UPDATE "stocktakes" SET "physical_quantity" = $1, "physical_amount" = $2, "updated_at" = $3 WHERE "stocktakes"."id" = $4

  def set_inventories_id

    #倉庫・ロケーションは１で固定（将来的に設定追加するかも）
	inventory = Inventory.find_by(material_master_id: @stocktake.material_master_id, warehouse_id: 1, location_id: 1)

	if inventory.present?
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."material_master_id" = $1 AND "inventories"."warehouse_id" = $2 AND "inventories"."location_id" = $3 LIMIT $4

    def set_stocktake
      @stocktake = Stocktake.find(params[:id])
---
SELECT "stocktakes".* FROM "stocktakes" WHERE "stocktakes"."id" = $1 LIMIT $2