app/controllers/storage_inventory_histories_controller.rb

SELECT "storage_inventory_histories".* FROM "storage_inventory_histories" WHERE "storage_inventory_histories"."id" = $1 LIMIT $2
---
  def new
    @storage_inventory_history = StorageInventoryHistory.new

    #初期値をセット(show画面からの遷移時のみ)
    if params[:new_flag] == "1"
      storage_inventory_history_prev = StorageInventoryHistory.where(id: params[:id]).first