app/controllers/storage_inventories_controller.rb

SELECT "storage_inventories".* FROM "storage_inventories" WHERE "storage_inventories"."id" = $1 LIMIT $2
---
    def set_storage_inventory
      @storage_inventory = StorageInventory.find(params[:id])