app/controllers/supplier_masters_controller.rb

    def set_supplier_master
      @supplier_master = SupplierMaster.find(params[:id])
---
SELECT "supplier_masters".* FROM "supplier_masters" WHERE "supplier_masters"."id" = $1 LIMIT $2