app/controllers/working_middle_items_controller.rb

SELECT "working_middle_items".* FROM "working_middle_items" WHERE "working_middle_items"."id" = $1 LIMIT $2
---
    def set_working_middle_item
      @working_middle_item = WorkingMiddleItem.find(params[:id])