app/controllers/working_times_controller.rb

SELECT "working_times".* FROM "working_times" WHERE "working_times"."id" = $1 LIMIT $2
---
    def set_working_time
      @working_time = WorkingTime.find(params[:id])