app/controllers/working_middle_items_controller.rb

  def item_extract

    if params[:working_middle_item_category_id] != ""
      #初期値として、”手入力”も選択できるようにする
      @item_extract  = WorkingMiddleItem.where(:id => "1").where("id is NOT NULL").order(:seq).
        pluck("working_middle_item_name, id").to_a

      #カテゴリー別のアイテムをセット
      @item_extract  += WorkingMiddleItem.where(:working_middle_item_category_id => params[:working_middle_item_category_id]).
          where("id is NOT NULL").order(:seq).pluck("working_middle_item_name, id").to_a

      #初期値として、”手入力”も選択できるようにする
      @item_short_name_extract  = WorkingMiddleItem.where(:id => "1").where("id is NOT NULL").order(:seq).
        pluck("working_middle_item_short_name, id").to_a
      #カテゴリー別のアイテムをセット
      @item_short_name_extract += WorkingMiddleItem.where(:working_middle_item_category_id =>
        params[:working_middle_item_category_id]).where("id is NOT NULL").order(:seq).
        pluck("working_middle_item_short_name, id").to_a
    else
    #カテゴリーがデフォルト（指定なし）の場合
      @item_extract = WorkingMiddleItem.all.order(:seq).pluck("working_middle_item_name, id").to_a

      @item_short_name_extract = WorkingMiddleItem.all.order(:seq).pluck("working_middle_item_short_name, id").to_a
---
SELECT working_middle_item_name, id FROM "working_middle_items" WHERE "working_middle_items"."working_middle_item_category_id" = $1 AND (id is NOT NULL) ORDER BY "working_middle_items"."seq" ASC
SELECT working_middle_item_name, id FROM "working_middle_items" WHERE "working_middle_items"."id" = $1 AND (id is NOT NULL) ORDER BY "working_middle_items"."seq" ASC
SELECT working_middle_item_short_name, id FROM "working_middle_items" WHERE "working_middle_items"."id" = $1 AND (id is NOT NULL) ORDER BY "working_middle_items"."seq" ASC

  def item_extract_subcategory

    if params[:working_middle_item_category_id] != "" && params[:working_subcategory_id] != ""

      #初期値として、”手入力”も選択できるようにする
      @item_extract  = WorkingMiddleItem.where(:id => "1").where("id is NOT NULL").order(:seq).
          pluck("working_middle_item_name, id").to_a
      #カテゴリー別のアイテムをセット(以下のみ、”item_extract”ファンクションと異なる。)
      if params[:working_subcategory_id] == "1"
        #サブカテゴリーが１の場合は、サブカテゴリー未選択とみなす。
        @item_extract  += WorkingMiddleItem.where(:working_middle_item_category_id =>
           params[:working_middle_item_category_id]).where("id is NOT NULL").order(:seq).
          pluck("working_middle_item_name, id").to_a
---
SELECT working_middle_item_short_name, id FROM "working_middle_items" WHERE "working_middle_items"."working_middle_item_category_id" = $1 AND (id is NOT NULL) ORDER BY "working_middle_items"."seq" ASC

    def set_working_middle_item
      @working_middle_item = WorkingMiddleItem.find(params[:id])
---
SELECT "working_middle_items".* FROM "working_middle_items" WHERE "working_middle_items"."id" = $1 LIMIT $2