app/controllers/working_small_items_controller.rb

SELECT "material_masters"."material_name" FROM "material_masters" WHERE "material_masters"."material_code" = $1 AND (id is NOT NULL)
SELECT "material_masters"."standard_quantity" FROM "material_masters" WHERE "material_masters"."material_code" = $1 AND (id is NOT NULL)
SELECT "material_masters"."list_price_quotation" FROM "material_masters" WHERE "material_masters"."material_code" = $1 AND (id is NOT NULL)
SELECT "material_masters"."standard_rate" FROM "material_masters" WHERE "material_masters"."material_code" = $1 AND (id is NOT NULL)
---
  def material_code_standard_select
     #品番
     @material_code = MaterialMaster.where(:material_code => params[:material_code]).where("id is NOT NULL").pluck(:material_code).flatten.join(",")


	 if @material_code.present?

       #id
       @material_id =  MaterialMaster.where(:material_code => params[:material_code]).where("id is NOT NULL").pluck(:id).flatten.join(",")

       #品名
       @material_name = MaterialMaster.where(:material_code => params[:material_code]).where("id is NOT NULL").pluck(:material_name).flatten.join(",")

	   #数量
	   @quantity = MaterialMaster.where(:material_code => params[:material_code]).where("id is NOT NULL").pluck(:standard_quantity).flatten.join(",")
	   #
       if @quantity.blank?   #未登録(null)なら１をセット
         @quantity = 1
       end

	   #単価(定価)
	   #@unit_price = MaterialMaster.where(:material_code => params[:material_code]).where("id is NOT NULL").pluck(:list_price).flatten.join(",")
	   #見積で使用するための定価(ケーブル等、定価ゼロなら直近単価が入っている）
       @unit_price = MaterialMaster.where(:material_code => params[:material_code]).where("id is NOT NULL").pluck(:list_price_quotation).flatten.join(",")

       #掛率
       @rate = MaterialMaster.where(:material_code => params[:material_code]).where("id is NOT NULL").pluck(:standard_rate).flatten.join(",")

SELECT "material_masters"."list_price_update_at" FROM "material_masters" WHERE "material_masters"."material_code" = $1 AND (id is NOT NULL)
---

       #add180331
       #定価一斉更新時の場合などで色をつける
       @update_date = MaterialMaster.where(:material_code => params[:material_code]).where("id is NOT NULL").pluck(:list_price_update_at).flatten.join(",")

SELECT "material_masters"."standard_labor_productivity_unit" FROM "material_masters" WHERE "material_masters"."material_code" = $1 AND (id is NOT NULL)
SELECT "material_masters"."maker_id" FROM "material_masters" WHERE "material_masters"."material_code" = $1 AND (id is NOT NULL)
SELECT "material_masters"."unit_id" FROM "material_masters" WHERE "material_masters"."material_code" = $1 AND (id is NOT NULL)
SELECT "material_masters"."last_unit_price" FROM "material_masters" WHERE "material_masters"."material_code" = $1 AND (id is NOT NULL)
---
       #add end

       #歩掛
	   @labor_productivity_unit = MaterialMaster.where(:material_code => params[:material_code]).where("id is NOT NULL").pluck(:standard_labor_productivity_unit).flatten.join(",")

       #メーカー add1802021
       @maker_master_id = MaterialMaster.where(:material_code => params[:material_code]).where("id is NOT NULL").pluck(:maker_id).flatten.join(" ")

       #単位    add1802021
       @unit_master_id = MaterialMaster.where(:material_code => params[:material_code]).where("id is NOT NULL").pluck(:unit_id).flatten.join(" ")

       #資材費（最終単価）add180201
       @material_price = MaterialMaster.where(:material_code => params[:material_code]).where("id is NOT NULL").pluck(:last_unit_price).flatten.join(",")