app/controllers/working_subcategories_controller.rb

  def subcategory_extract
    if params[:working_category_id] != ""

      #初期値の空白をセット
      array  = WorkingSubcategory.where(:id => "1").where("id is NOT NULL").pluck("name, id")  #restore 180208

      #カテゴリー別のアイテムをセット
      array += WorkingSubcategory.where(:working_category_id => params[:working_category_id]).where("id is NOT NULL").order(:seq).
        pluck("name, id")
---
SELECT name, id FROM "working_subcategories" WHERE "working_subcategories"."id" = $1 AND (id is NOT NULL)
SELECT name, id FROM "working_subcategories" WHERE "working_subcategories"."working_category_id" = $1 AND (id is NOT NULL) ORDER BY "working_subcategories"."seq" ASC