app/controllers/working_middle_items_controller.rb

  def destroy_small_items
    WorkingSmallItem.where(working_middle_item_id: @working_middle_item.id).destroy_all
---
DELETE FROM "working_middle_items" WHERE "working_middle_items"."id" = $1