app/models/inventory_history.rb

SELECT SUM("inventory_histories"."price") FROM "inventory_histories" WHERE "inventory_histories"."inventory_division_id" != $1 LIMIT $2 OFFSET $3
---
  def self.sumPrice
    #sum(:price)
    where.not(:inventory_division_id => $INDEX_INVENTORY_SHIPPING).sum(:price)

SELECT SUM("inventory_histories"."price") FROM "inventory_histories" WHERE "inventory_histories"."inventory_division_id" = $1 LIMIT $2 OFFSET $3
---
  def self.sumShipPrice
    #sum(:price)
    where(:inventory_division_id => $INDEX_INVENTORY_SHIPPING).sum(:price) * -1

SELECT SUM("inventory_histories"."quantity") FROM "inventory_histories" WHERE "inventory_histories"."inventory_division_id" != $1 LIMIT $2 OFFSET $3
---
  def self.sumQuantity
    where.not(:inventory_division_id => $INDEX_INVENTORY_SHIPPING).sum(:quantity)

SELECT SUM("inventory_histories"."quantity") FROM "inventory_histories" WHERE "inventory_histories"."inventory_division_id" = $1 LIMIT $2 OFFSET $3
---
  def self.sumShipQuantity
    where(:inventory_division_id => $INDEX_INVENTORY_SHIPPING).sum(:quantity) * -1