app/models/purchase_unit_price.rb

SELECT COUNT(*) FROM (SELECT 1 AS one FROM "purchase_unit_prices") subquery_for_count
---
  def purchase_unit_price_count_must_be_within_limit
    errors.add(:base, "デモ版は#{MAX_RECORD_COUNT}件しか登録できません") if PurchaseUnitPrice.count >= MAX_RECORD_COUNT