app/models/quotation_detail_large_classification.rb

SELECT "quotation_detail_large_classifications".* FROM "quotation_detail_large_classifications" WHERE (quotation_header_id = 8) AND (construction_type <> '1' )
---
  def self.sumpriceQuote
    #工事種別が通常かまたは値引の場合のみ合算。
    #where("construction_type = ? or construction_type = ? ", "0", $INDEX_DISCOUNT.to_s ).sum(:quote_price)

    #工事種別が小計以外は加算する
    #where("construction_type <> ? ", $INDEX_SUBTOTAL.to_s ).sum(:quote_price)
    #Rails6対応 upd230719 ↑これだとdistinctされてしまう
    where("construction_type <> ? ", $INDEX_SUBTOTAL.to_s ).where.not(quote_price: nil).sum(&:quote_price)