app/models/unit_master.rb

SELECT "unit_masters".* FROM "unit_masters" WHERE "unit_masters"."id" = $1 ORDER BY "unit_masters"."id" ASC LIMIT $2
---
  def self.all_list_by_id(unit_master_id)
    unit_master = UnitMaster.where(id: unit_master_id).first