app/views/quotation_detail_large_classifications/_modal.html.erb

SELECT "working_middle_items".* FROM "working_middle_items" ORDER BY seq
---
          <%= f.label :working_large_item_short_name , {:class => "my-custom-class-l"} %></br>
          <%= f.collection_select :working_large_item_short_name, WorkingMiddleItem.order('seq').all, :id, :working_middle_item_short_name,
          {:selected => @quotation_detail_large_classification.working_large_item_id || 1} , {id:'working_large_item_short_name',
          :class => "searchableSelect2_2",  style: 'width:190px' } %></br>

SELECT "working_categories".* FROM "working_categories" ORDER BY seq
---

          <%= f.select :working_middle_item_category_id_call, WorkingCategory.order('seq').all.map{|t| [t.category_name, t.id]}, {:include_blank => true},
          {id:'working_middle_item_category_id_call', :class => "my-custom-class", style: 'width:190px;font-size:14px;',
          :onchange => "setItemExtractByCategory(1)",:tabindex=>"3" } %>

SELECT "working_categories".* FROM "working_categories" ORDER BY seq
---

          <%= f.select :working_middle_item_category_id, WorkingCategory.order('seq').all.map{|t| [t.category_name, t.id]}, {:selected => @quotation_detail_large_classification.working_middle_item_category_id || 1},
          {id:'working_middle_item_category_id', :class => "my-custom-class", style: 'width:190px;font-size:14px;',
          :tabindex=>"4", :onchange => "setSubacategoryExtractByParent(2)" } %>

SELECT "working_subcategories".* FROM "working_subcategories"
---

          <%= f.select :working_middle_item_subcategory_id_call, WorkingSubcategory.all.map{|t| [t.name, t.id]}, {:include_blank => true},
          {id:'working_middle_item_subcategory_id_call', :class => "my-custom-class", style: 'width:190px;font-size:14px;', :onchange => "setItemExtractBySubCategory()",:tabindex=>"5" } %>

SELECT "working_subcategories".* FROM "working_subcategories"
---

          <%= f.select :working_middle_item_subcategory_id, WorkingSubcategory.all.map{|t| [t.name, t.id]}, {:include_blank => true},
          {id:'working_middle_item_subcategory_id', :class => "my-custom-class", style: 'width:190px;font-size:14px;',:tabindex=>"6" } %>

SELECT "working_specific_middle_items".* FROM "working_specific_middle_items" WHERE "working_specific_middle_items"."quotation_header_id" = $1 ORDER BY seq
SELECT "working_specific_middle_items".* FROM "working_specific_middle_items" ORDER BY seq
---

          <%= f.collection_select :working_specific_middle_item_id, WorkingSpecificMiddleItem.where(:quotation_header_id => params[:quotation_header_id]).order('seq'), :id, :working_middle_item_name,
          {:include_blank => true} ,
          {id:'working_specific_middle_item_id', :class => "searchableSelect2_5",  style: 'width:210px' } %>

          <!--<%= f.collection_select :working_specific_middle_item_id, WorkingSpecificMiddleItem.order('seq').all, :id, :working_middle_item_name,
          {:include_blank => true} ,
          {id:'working_specific_middle_item_id', :class => "searchableSelect2_5",  style: 'width:210px' } %>-->

SELECT "working_units".* FROM "working_units"
---
          <%= f.label :"単位" , {style: 'margin-left:-15px;'} %></br>
          <%= f.collection_select :working_unit_id, WorkingUnit.all, :id, :working_unit_name, {:prompt => 'どれか一つを選択して下さい',
          :selected => @quotation_detail_large_classification.working_unit_id || 1 } , {id:'working_unit_id', :class => "searchableSelect2_4",  style: 'width:120px' } %></br>

SELECT "working_subcategories".* FROM "working_subcategories" ORDER BY seq
---

        <%= f.collection_select :working_subcategory_select_hide, WorkingSubcategory.order('seq').all, :id, :name,  {} ,
        {id:"working_subcategory_select_hide",  hidden: true  } %>